{"id": "4dz8vw", "user": "dotchianni", "root": "4dz8vw", "reply_to": null, "timestamp": 1460162157, "text": "I am asking for a friend because she doesn't have a reddit account. She is a huge DV advocate since her husband murdered our friend and sent her to ICU in critical condition back in 2006. I am also an advocate but I am more quiet about it and help in the background when someone needs it. \n\nAnyway, here is her question. I am editing it for grammar and clarity. Also, if you know a better subreddit for this, let me know so I can post it there.\n\n**From PC:**\n\nIf you are in the field of law and legislation (they have a few LEO's answering too), these questions are for you. \n\nWhat areas do you feel needs to be addressed in helping victims families and survivors? More money to the budget? Addressing changes in laws so no loop holes can get a offender a lesser sentence than deserve? I want to here from you. What is your perspective in addressing the area of helping get justice for victims. Don't want to comment below that's okay direct message me. ", "meta": {"score": 1, "top_level_comment": null, "retrieved_on": 1463531776, "gilded": 0, "gildings": null, "subreddit": "AskACop", "stickied": false, "permalink": "/r/AskACop/comments/4dz8vw/what_areas_do_you_feel_needs_to_be_addressed_in/", "author_flair_text": ""}}
{"id": "4ggmg9", "user": "protomor", "root": "4ggmg9", "reply_to": null, "timestamp": 1461635068, "text": "So I bought a car july of last year. Long story short, it needed an engine and I changed it to a manual transmission. And both front and rear windows. I registered it last week and got plates that are good until next month but since I bought the car in Maryland, it doesn't have a VA state inspection sticker.\n\nNow that it can drive, I'm getting a few check engine lights and am trying to work through them but they only happen after you drive the car a few miles. I'm kind of in a catch 22 here. What's the best way to go about this? The CELs are emissions related so far. I'd like to do this properly but I really have no clue what proper is at this point. ", "meta": {"score": 1, "top_level_comment": null, "retrieved_on": 1463574188, "gilded": 0, "gildings": null, "subreddit": "AskACop", "stickied": false, "permalink": "/r/AskACop/comments/4ggmg9/virginia_fixing_up_a_car_i_just_registered_have/", "author_flair_text": ""}}
{"id": "5yv57g", "user": "emeraldmaye", "root": "5yv57g", "reply_to": null, "timestamp": 1489269062, "text": "I'm in a domestic abuse situation right now with my roommates, and am trying to figure out how to get out of it. I've been to a lawyer for some advice [thanks to a work benefit I got 30 minutes free], but there were a few things I forgot to ask if they were legal, and also wanted the perspective of if/when to go to the police from someone in law enforcement.\n\nThere's a big problem in that trying to get proof of the abuse is difficult, because at this point it is all emotional. So, we are trying to find anything we can that can be brought against her and/or her boyfriend.\n\nThere are 5 people in a 2 bedroom apartment. Four people are on the lease, and legally there are only supposed to be four people living there. Female Abuser is the primary abuser, and Male Abuser is the lesser abuser and mainly her enabler. Female Abuser is not on the lease, but Male Abuser is, as well as myself and the two other tennants.\n\nWe are trying to fix this situation by getting her kicked out, and Male Abuser will probably follow her.\n\nOne of my other roommates had suggested that we take some of their mail, since we know that she is receiving her mail here. But, I was worried about that falling under the federal crime even though we're all in the same place. My question is, is it illegal to take a picture of the unopened envelope or mail left on a table?\n\nWe are having trouble figuring out a way to really prove that she lives here that could not easily be explained away, especially since the apartment complex is required to give 48 hour notice before they visit.\n\nA friend suggested that I try to get my neighbors to help and complain. And with some of the fights she's had with her boyfriend, I've considered calling the cops.\n\nAnd there was a time that she refused to give me my car keys until another roommate stepped in. Had that continued, I would have called the cops.\n\nOne of the things I'm worried about is getting in trouble for her pot. We don't want her here, we can't get our leasing office to do anything, and if we call the cops on them we're afraid of being lumped in with them.\n\nAlso, I live in Pennsylvania, so that answers the question on if we can record anything without their knowledge or not (we can't).\n\nAny insight on how to get our abusers kicked out would be amazing. We really don't want to wait for things to escalate to physical abuse before we finally have proof to go forward.", "meta": {"score": 1, "top_level_comment": null, "retrieved_on": 1492400284, "gilded": 0, "gildings": null, "subreddit": "AskACop", "stickied": false, "permalink": "/r/AskACop/comments/5yv57g/abusive_roommates_and_trying_to_find_proof/", "author_flair_text": ""}}
{"id": "602zvy", "user": "Thraxzor", "root": "602zvy", "reply_to": null, "timestamp": 1489821935, "text": "Hello everyone! I was wondering if it is illegal to have an airsoft gun replica in your profile picture on a social network, say facebook.I am from Romania and as far as i know airsoft guns here are legal up to a certain speed of the BB, so is it dangerous? should i be expecting SWAT? :D thank you in advance!", "meta": {"score": 1, "top_level_comment": null, "retrieved_on": 1492423052, "gilded": 0, "gildings": null, "subreddit": "AskACop", "stickied": false, "permalink": "/r/AskACop/comments/602zvy/airsoft_gun_in_profile_picture/", "author_flair_text": ""}}
{"id": "6078u3", "user": "[deleted]", "root": "6078u3", "reply_to": null, "timestamp": 1489881223, "text": "[deleted]", "meta": {"score": 1, "top_level_comment": null, "retrieved_on": 1492425175, "gilded": 0, "gildings": null, "subreddit": "AskACop", "stickied": false, "permalink": "/r/AskACop/comments/6078u3/traffic_law_question_right_of_way_in_this_scenario/", "author_flair_text": ""}}
{"id": "4woaax", "user": "[deleted]", "root": "4woaax", "reply_to": null, "timestamp": 1470627706, "text": "[deleted]", "meta": {"score": 1, "top_level_comment": null, "retrieved_on": 1473026771, "gilded": 0, "gildings": null, "subreddit": "AskACop", "stickied": false, "permalink": "/r/AskACop/comments/4woaax/what_flashlight_do_you_use_as_a_carryon/", "author_flair_text": ""}}
{"id": "4zei90", "user": "Retrogaymer", "root": "4zei90", "reply_to": null, "timestamp": 1472069049, "text": "What advice can you offer for an agoraphobe who is so terrified of cops that the sight of them causes panic attacks? After reading so many stories about how mentally ill people are treated by cops I can't imagine not being gunned down if a panic attack gets beyond my ability to control. Having been told that having a panic attack in public warrants a charge for disturbing the peace doesn't help. ", "meta": {"score": 1, "top_level_comment": null, "retrieved_on": 1473076718, "gilded": 0, "gildings": null, "subreddit": "AskACop", "stickied": false, "permalink": "/r/AskACop/comments/4zei90/advice_for_mentally_ill/", "author_flair_text": ""}}
{"id": "48vb57", "user": "LADudeThrowaway", "root": "48vb57", "reply_to": null, "timestamp": 1457057792, "text": "Hey guys. Throwaway, obviously. So I live in Los Angeles and something happened last night that freaked me out and I'm looking for advice on how to proceed, or if there's anything I should do at all.\n\nI co-rent a practice studio in Hollywood where I go to play music. Last night I was going there to practice and I needed to stop by the ATM to pick up cash so I could give rent money to my roommate. I parked, ran up, took out some money, and ran back to the car since I wasn't sure whether I'd parked legally.\n\nAs I was getting in my car, two uniformed police officers rolled up to me in an unmarked car. I rolled down my window and they told me \"We've been watching you. We know what you've been up to.\" and drove away before I could ask any questions.\n\nAt the time, I thought it was hilarious. I thought they were gonna give me a parking ticket at first, but then I assumed these guys were bored and just decided to fuck with someone they saw who was obviously in a hurry. Everyone's got a guilty conscience, right?\n\nThe more I thought about it, though, the more worried I got. I'm a pretty law abiding guy; I smoke pot but I have a medical card, and there's nothing I can think of that I've done that could land me in trouble with the law. I also blatantly jaywalked across the street right in front of these guys, so if they really wanted to get up in my business they could've.\n\nBut what if there's some kind of an identity theft situation going on? What if I just look similar to someone who's been doing something shady? They drove right by my car, so they have my license plate number, and if they're associating it with someone who's committed or planning on committing a crime, that could be a problem for me.\n\nAny police officers have any idea what I should do, if anything?", "meta": {"score": 2, "top_level_comment": null, "retrieved_on": 1463444335, "gilded": 0, "gildings": null, "subreddit": "AskACop", "stickied": false, "permalink": "/r/AskACop/comments/48vb57/cops_pulled_up_and_told_me_weve_been_watching_you/", "author_flair_text": ""}}
{"id": "4bzhdb", "user": "KuKluxPlan", "root": "4bzhdb", "reply_to": null, "timestamp": 1458957554, "text": "", "meta": {"score": 3, "top_level_comment": null, "retrieved_on": 1463497652, "gilded": 0, "gildings": null, "subreddit": "AskACop", "stickied": false, "permalink": "/r/AskACop/comments/4bzhdb/what_is_the_large_rectangular_thing_on_her_belt/", "author_flair_text": ""}}
{"id": "3vqkde", "user": "[deleted]", "root": "3vqkde", "reply_to": null, "timestamp": 1449454833, "text": "[deleted]", "meta": {"score": 1, "top_level_comment": null, "retrieved_on": 1454898773, "gilded": 0, "gildings": null, "subreddit": "AskACop", "stickied": false, "permalink": "/r/AskACop/comments/3vqkde/can_someone_help_me_out_with_the_radio_shorthand/", "author_flair_text": ""}}
{"id": "3vrmlf", "user": "ChocolatePopes", "root": "3vrmlf", "reply_to": null, "timestamp": 1449475042, "text": "So last month, my gf and I found a guy sleeping in our bed. We tried to get him to leave, but he was too drunk to get up. He didn't want to leave. Despite many tries, we had to call the police. He was arrested. Recently we just found his wallet. He has his entire life in there. Any easy way to return it? Could I give it to the officer that wrote the report?", "meta": {"score": 1, "top_level_comment": null, "retrieved_on": 1454899268, "gilded": 0, "gildings": null, "subreddit": "AskACop", "stickied": false, "permalink": "/r/AskACop/comments/3vrmlf/returning_a_wallet_to_the_man_who_broke_into_my/", "author_flair_text": ""}}
{"id": "3w8hju", "user": "Firehosecargopants", "root": "3w8hju", "reply_to": null, "timestamp": 1449762173, "text": "", "meta": {"score": 2, "top_level_comment": null, "retrieved_on": 1454918434, "gilded": 0, "gildings": null, "subreddit": "AskACop", "stickied": false, "permalink": "/r/AskACop/comments/3w8hju/does_declaring_you_have_a_weapon_in_trunk/", "author_flair_text": ""}}
{"id": "3x68cn", "user": "balancespec2", "root": "3x68cn", "reply_to": null, "timestamp": 1450325941, "text": "There was a thing in Florida where cops pulled people over and elicited their interests and then surprised them with an expensive gift. Since the purpose of the stop was a gimmick, would any contraband discovered be inadmissable due to lack of PC for the stop? ", "meta": {"score": 1, "top_level_comment": null, "retrieved_on": 1454934530, "gilded": 0, "gildings": null, "subreddit": "AskACop", "stickied": false, "permalink": "/r/AskACop/comments/3x68cn/if_someone_who_got_pulled_over_for_that_secret/", "author_flair_text": ""}}
{"id": "3ydhhg", "user": "emcarthur420", "root": "3ydhhg", "reply_to": null, "timestamp": 1451198322, "text": "Idk if I'm breaking any rules to this sub with this post, if I do I apologize in advance. \n\nI live in Palm Beach County in south Florida. My license expired in June and my work schedule really hinders my ability to go get s new one. Now I still have my New York license. I've been pulled over twice once for expired registration on the truck and then the second time for some bullshit but I was in a neighborhood I shouldn't have been with a kid I shouldn't have been with. Both times I got pulled over once they found out that my license was expired and I had to step out of the car and they searched me and the car. My question is, is this legal? I don't understand how an expired license gives them probable cause to search my person and vehicle. Both times I felt like I was being profiled because I'm white living in a predominantly black/Haitian community with a quickly growing recovery community so most of the white kids are recovering heroine addicts which I fall into. If anyone can shine s light on this for me it'd be greatly appreciated. ", "meta": {"score": 1, "top_level_comment": null, "retrieved_on": 1454955062, "gilded": 0, "gildings": null, "subreddit": "AskACop", "stickied": false, "permalink": "/r/AskACop/comments/3ydhhg/any_south_florida_officers_present/", "author_flair_text": ""}}
{"id": "2jj5qj", "user": "simmiauto246", "root": "2jj5qj", "reply_to": null, "timestamp": 1413565572, "text": "first of all he is an idiot, my buddy was drunk in a public park in a school zone decided it was a good idea to shoot off his illegal gun 2 times had more in the clip and one in the chamber maybe hollow tips I'm not 100% sure. possession of a bunch of oc 30s as well.. Massachusetts is where his life got twisted upside down also was underage I know its a lot to read but it happened", "meta": {"score": 3, "top_level_comment": null, "retrieved_on": 1441117956, "gilded": 0, "gildings": null, "subreddit": "AskACop", "stickied": false, "permalink": "/r/AskACop/comments/2jj5qj/is_my_friend_facing_mandatory_time_what_would_he/", "author_flair_text": ""}}
{"id": "2bnhk2", "user": "Frago242", "root": "2bnhk2", "reply_to": null, "timestamp": 1406251840, "text": "Full disclosure. I didn't realize it but I was past 3 months due so I don't fault the officer for being petty here. The day before my three month out of date registration I just so happened to go to inspection and failed, that same day I paid for new tires and passed the next day. Then the weekend came then it was Tuesday and I got pulled. I showed the officer my failed/passed inspection and explained that I just needed to go online to pay and get the sticker but he gave me a ticket anyhow. The ticket is 210 dollars most of it is \"court fees\". He said if I go to court they will just throw this out with no fines but I'm guessing I still get to pay the \"court fees\" no matter what. Am I correct on this? The fine is $25 and the rest is \"court fees\". I have the option to just pay it online and I am thinking for 25 bucks I could just suck it up and not have to deal with the court thing.", "meta": {"score": 2, "top_level_comment": null, "retrieved_on": 1441252140, "gilded": 0, "gildings": null, "subreddit": "AskACop", "stickied": false, "permalink": "/r/AskACop/comments/2bnhk2/i_got_pulled_for_out_of_date_registration_tag_and/", "author_flair_text": ""}}
{"id": "317auw", "user": "[deleted]", "root": "317auw", "reply_to": null, "timestamp": 1427989470, "text": "Hello,\nMy wife encountered a random checkpoint on a main road this morning where they simply asked to see her license and then let her through. Are checkpoints like this legal? and did she have to consent?  Thanks in advance!", "meta": {"score": 1, "top_level_comment": null, "retrieved_on": 1440817339, "gilded": 0, "gildings": null, "subreddit": "AskACop", "stickied": false, "permalink": "/r/AskACop/comments/317auw/legality_of_license_check_points/", "author_flair_text": ""}}
{"id": "336wxy", "user": "8th1der00", "root": "336wxy", "reply_to": null, "timestamp": 1429497561, "text": "", "meta": {"score": 3, "top_level_comment": null, "retrieved_on": 1440783359, "gilded": 0, "gildings": null, "subreddit": "AskACop", "stickied": false, "permalink": "/r/AskACop/comments/336wxy/how_do_cops_put_someone_with_one_arm_in_handcuffs/", "author_flair_text": ""}}
{"id": "2nd1cg", "user": "SithLordDarthRevan", "root": "2nd1cg", "reply_to": null, "timestamp": 1416913406, "text": "Simply to retrieve my possessions and detain until authorities arrive.\n\nAlternatively, what if he dies.", "meta": {"score": 2, "top_level_comment": null, "retrieved_on": 1441052813, "gilded": 0, "gildings": null, "subreddit": "AskACop", "stickied": false, "permalink": "/r/AskACop/comments/2nd1cg/if_someone_robbed_me_but_i_pulled_a_gun_on_him_as/", "author_flair_text": ""}}
{"id": "2g1rl0", "user": "killlsurfcity", "root": "2g1rl0", "reply_to": null, "timestamp": 1410388215, "text": "I got pulled over late at night on a highway, by a completely batshit \"cop\" who it turned was a fake. He had the uniform, the badge, lights, etc. I was on a highway, and It was my first time being pulled over, so I pulled over to the left grassy median instead of the right wooded shoulder area, not knowing you're only supposed to pull to the right. I feel like that's why he didn't end up hurting me, or whatever he would've done if I'd pulled over into the wooded area on the right side. ANYWAYS, the guy was an absolute lunatic. Really fucking scary. He had piercings (not allowed here) and was shouting unintelligibly at me on a shitty-sounding megaphone from his car, before he came to my car and threatened to arrest me for absolutely nothing. There was something REALLY wrong with this guy. He was just fucking nuts. All red in the face and screaming at me. He was totally enraged and said that he had been telling me over the megaphone to get out of my car. I really feel like this dude would've hurt me if he thought he could get away with it. I actually saw him pulled over, surrounded by legit cop cars, miles down the road. And yes, it was later confirmed by another cop that this guy wasn't actually a cop. \n\nPoint being, what do I do if a cop is trying to pull me over but I don't feel safe enough? I heard you're supposed to put on your hazards so that he knows to follow you to a gas station or like a lit parking lot, but I wouldn't want to get arrested for \"fleeing\" or something. ", "meta": {"score": 3, "top_level_comment": null, "retrieved_on": 1441177142, "gilded": 0, "gildings": null, "subreddit": "AskACop", "stickied": false, "permalink": "/r/AskACop/comments/2g1rl0/what_should_i_do_if_i_just_dont_feel_safe_pulling/", "author_flair_text": ""}}
{"id": "2xufjz", "user": "TrippEvans", "root": "2xufjz", "reply_to": null, "timestamp": 1425425486, "text": "Who was so obviously high you almost laughed?", "meta": {"score": 2, "top_level_comment": null, "retrieved_on": 1440874478, "gilded": 0, "gildings": null, "subreddit": "AskACop", "stickied": false, "permalink": "/r/AskACop/comments/2xufjz/whats_the_most_obvious_stoner_youve_ever_see/", "author_flair_text": ""}}
{"id": "308soy", "user": "Hispanicatth3disc0", "root": "308soy", "reply_to": null, "timestamp": 1427285448, "text": "Say o went to the local Buffalo Wild Wings to watch some March Madness, caught two games. I have a single beer when I first arrive, with my appetizer. I chill and eat and watch two basketball games and then head home. All in all its been at least 4 hours since I had that beer. If, on the drive home, I get pulled over for say speeding or a missing turn signal or taillight, whatever; something simple, and I am asked if I'd been drinking tonight (seems to be a formality around here to ask) do I tell you I had that beer hours ago? Or is that incriminating myself? \n\nThis was a small debate me and friends were having. \n\nThanks!", "meta": {"score": 2, "top_level_comment": null, "retrieved_on": 1440833618, "gilded": 0, "gildings": null, "subreddit": "AskACop", "stickied": false, "permalink": "/r/AskACop/comments/308soy/do_i_tell_you_about_single_beer_i_had_4_hours_ago/", "author_flair_text": ""}}
{"id": "30c3cg", "user": "[deleted]", "root": "30c3cg", "reply_to": null, "timestamp": 1427341285, "text": "Ok, so my roommate used to date the girl I am dating now (I know, bad situation) and he had a bunch of her things stored in his room and keeps it dead bolt locked so no one can go in and retrieve her property. He has even resorted to taking my mail and packages that I have delivered at my apartment.\n\nWe had an officer come over and ask him if he could come inside his room so we could get her stuff back but he wouldn't let her in. So this did nothing for us.\n\nWhat is the best way we can provide probable cause to allow entry into his room? ", "meta": {"score": 2, "top_level_comment": null, "retrieved_on": 1440832081, "gilded": 0, "gildings": null, "subreddit": "AskACop", "stickied": false, "permalink": "/r/AskACop/comments/30c3cg/need_help_retrieving_stolen_property/", "author_flair_text": ""}}
{"id": "30teex", "user": "40swXD", "root": "30teex", "reply_to": null, "timestamp": 1427730206, "text": "Going on a ride-along this Friday, looking for some help with footwear. I know I have to wear collared shirt and nice pants, but can't decide whether I should wear boots or something else. \n\nLooking at replacing my tims with these and figured I could wear these, unless that'd be dumb: http://www.batesfootwear.com/US/en-US/Product.mvc.aspx/15072M/0/Mens/GX-8-Desert-Composite-Toe-Side-Zip-Boot?dimensions=0\n\nJust want something that would protect my feet, and need new boots for work anyways.\n\nThanks for advice!", "meta": {"score": 2, "top_level_comment": null, "retrieved_on": 1440823944, "gilded": 0, "gildings": null, "subreddit": "AskACop", "stickied": false, "permalink": "/r/AskACop/comments/30teex/ridealong_advice/", "author_flair_text": ""}}
{"id": "4o5kf3", "user": "LittleBabysIceCream", "root": "4o5kf3", "reply_to": null, "timestamp": 1465964520, "text": "I am looking to color the chrome parts of my headlights on my Mazda 3 (Heres the lights: http://static.howstuffworks.com/gif/vehicle-pictures/2006/mazda/3/3288-043-headlight-480.jpg) I want to paint all the shiny bits red to match the color scheme of my car. I know tinting the entire light is illegal because it emits a pinkish glow so you can be ticketed for imitating and officer. Can the same thing happen if the reflectors are painted but the light remains white/amber?\n\nEdit: here's what I want to do: https://www.youtube.com/watch?v=7xCjxjVDgJ0 He jokingly speaks of getting pulled over but he says in the comments, after 6 months of having this, nothing has happened.", "meta": {"score": 1, "top_level_comment": null, "retrieved_on": 1472779178, "gilded": 0, "gildings": null, "subreddit": "AskACop", "stickied": false, "permalink": "/r/AskACop/comments/4o5kf3/moving_to_texas_and_modding_my_car_can_i_get_a/", "author_flair_text": ""}}
{"id": "56n9k7", "user": "[deleted]", "root": "56n9k7", "reply_to": null, "timestamp": 1476034768, "text": "[deleted]", "meta": {"score": 1, "top_level_comment": null, "retrieved_on": 1480216017, "gilded": 0, "gildings": null, "subreddit": "AskACop", "stickied": false, "permalink": "/r/AskACop/comments/56n9k7/connecticut_driving_without_a_license/", "author_flair_text": ""}}
{"id": "59milv", "user": "garmonboziamilkshake", "root": "59milv", "reply_to": null, "timestamp": 1477548464, "text": "", "meta": {"score": 1, "top_level_comment": null, "retrieved_on": 1480277207, "gilded": 0, "gildings": null, "subreddit": "AskACop", "stickied": false, "permalink": "/r/AskACop/comments/59milv/is_it_technically_illegal_to_openly_bet_reddit/", "author_flair_text": ""}}
{"id": "2v25bn", "user": "[deleted]", "root": "2v25bn", "reply_to": null, "timestamp": 1423280964, "text": "I live next door to a high school. On certain Fridays and Saturdays when they have dances or what not, noise level is so loud that it actually shakes my windows and I can't hear the television. Can I do anything?", "meta": {"score": 1, "top_level_comment": null, "retrieved_on": 1440921868, "gilded": 0, "gildings": null, "subreddit": "AskACop", "stickied": false, "permalink": "/r/AskACop/comments/2v25bn/noise_so_much_noise/", "author_flair_text": ""}}
{"id": "2v26qr", "user": "811281128112", "root": "2v26qr", "reply_to": null, "timestamp": 1423281806, "text": "Hello, quick queston regarding hit and run investigations, sorry in advance for the long post.\n\nMy parked car was involved in a hit and run accident.  The offending vehicle fled the scene, but witnesses called the police and identified the make and color of the vehicle, and provided a general description, but were not able to record a license plate. I filed a police report the following morning when i discovered the damage.  I recovered debris from the accident which confirmed the make of the offending vehicle, as well as additional pieces of the offending vehicle, which I have saved.\n\nOne week later, I spotted a car matching the exact description of the offending vehicle, with damage that matched the hit and run incident. This vehicle was parked on the same street on which the incident occured, parked one block down from where the incident occured.\n\nIs there any recourse for holding this individual responsible for the accident? I live in a major city, so I understand that this is not a priority by any means, I am just wondering what, if any, actions the police may be willing to take.\n\nI have called my local police district as well as my insurance company, since they have the most financial interest in the matter. I was brushed off by my police district over the phone, but am planning on going to the station tomorrow, primarily because I would just like to ensure that the information I have on the potentially-offending vehicle is documented. Any advice or insight would be greatly appreciated. Thanks!", "meta": {"score": 2, "top_level_comment": null, "retrieved_on": 1440921849, "gilded": 0, "gildings": null, "subreddit": "AskACop", "stickied": false, "permalink": "/r/AskACop/comments/2v26qr/hit_and_run_identification_postaccident/", "author_flair_text": ""}}
{"id": "2vhz5a", "user": "awfulbeans", "root": "2vhz5a", "reply_to": null, "timestamp": 1423626660, "text": "So a friend is an unemployed locksmith. Last night he spotted someone having problems getting into their car. Keys were in the ignition, doors locked, etc.\n\nHe helped them out, and as he normally does, asked for an ID and the registration to verify it's their car. The guy said he didn't have his ID, but had an Amex gift card with $100 left on it. He handed it to him, showed other cards in his wallet with the same name on them, drove off. Friend never got any information (mistake #1, didn't even get plates).\n\nMistake #2 was spending $100 on a TV at Wal-Mart (followed by dinner at a burger place, but this is a local burger place that's not going to have hundreds of cameras like a typical Wal-Mart).\n\nMistake #3 was not checking to see if it's an actual gift card. He called me today asking if I knew how to check the balance on an Amex gift card. I asked him which kind of Amex gift card. He said \"It just says American Express\". I know Amex gift cards don't say that, so I asked \"does it say 'A Gift For You', 'Gift Card', or anything like that where the name would be?\". He said no, and read off the name. I asked him what color the card was, he said gold.\n\nWell fuck.\n\nI googled the name. It's a unique enough name that the first hit turned up someone about a mile away from him. The name could be male or female depending on the spelling; the spelling is female, but the person he helped was a male. Making it better, this person is actually registered with the Texas BAR as a lawyer, and a legal columnist for a magazine.\n\nThe final piece: I looked up crime reports - there was one filed at her address 2 days ago, theft from a vehicle. So the card is hot. Super hot.\n\nHe's freaking out and has no idea what to do. I've thought about suggesting he contact the police department on the non-emergency number, or Amex, and being honest, and asking what to do - but I don't want to get him in any deeper shit than he already is (he's not the brightest person, as you can guess). He doesn't have the money to lawyer up (he's about to be evicted, and his family has cut him off because of his alcoholism). The TV is still sealed in the box.\n\nI'm sure if he tried to return the TV now, the return probably wouldn't go through, as the card has likely been reported stolen by now (and even if it does, that puts him in front of dozens more cameras). And Wal-Mart tracks the serial numbers of big ticket items like that, even a dinky 19\" TV.\n\nSuggestions?", "meta": {"score": 2, "top_level_comment": null, "retrieved_on": 1440914363, "gilded": 0, "gildings": null, "subreddit": "AskACop", "stickied": false, "permalink": "/r/AskACop/comments/2vhz5a/friend_is_a_locksmith_was_given_a_gift_card_by/", "author_flair_text": ""}}
{"id": "2ws4jl", "user": "jeremyfrankly", "root": "2ws4jl", "reply_to": null, "timestamp": 1424629562, "text": "So I'm at a Brooklyn Chinese New Year parade and I noticed all the officers had these straight wood-grain (so they stood out) batons instead of nightsticks. Is this a common thing? If so, why might they change it? I thought the nightstick was supposed to be superior", "meta": {"score": 2, "top_level_comment": null, "retrieved_on": 1440892530, "gilded": 0, "gildings": null, "subreddit": "AskACop", "stickied": false, "permalink": "/r/AskACop/comments/2ws4jl/officers_equipped_with_wooden_batons_instead_of/", "author_flair_text": ""}}
{"id": "2x1l6f", "user": "throwawayforcopqs", "root": "2x1l6f", "reply_to": null, "timestamp": 1424817985, "text": "[Is this legal to drive?](http://imgur.com/SnQopKb)\n\nIf not, what can I do to make it street legal once more?\n\nedit: link fix", "meta": {"score": 2, "top_level_comment": null, "retrieved_on": 1440887994, "gilded": 0, "gildings": null, "subreddit": "AskACop", "stickied": false, "permalink": "/r/AskACop/comments/2x1l6f/i_got_rearended_last_night_and_am_waiting_for_the/", "author_flair_text": ""}}
{"id": "2xd7e2", "user": "telehubby", "root": "2xd7e2", "reply_to": null, "timestamp": 1425055703, "text": "Obviously, an open beer can or the like in the cup holder is obviously a no-no, and for good reason.  But what if I'm taking a bottle of liquor to a party and returning with a half empty bottle.  The seal is broken, and the cap is screwed on, but I don't know where the line is with open resealble containers.  My questions: could an officer that pulls me over (say, for a minor traffic violation) arrest me for DUI, even if I have had nothing to drink, because of open container laws?  What if the bottle is in the back seat and out of my reach, or if it's a flask or something that's in reach of me, but I haven't been drinking?  Would all be forgiven if I blew a 0.00?", "meta": {"score": 3, "top_level_comment": null, "retrieved_on": 1440882515, "gilded": 0, "gildings": null, "subreddit": "AskACop", "stickied": false, "permalink": "/r/AskACop/comments/2xd7e2/what_exactly_defines_an_open_container_while/", "author_flair_text": ""}}
{"id": "3f0i16", "user": "[deleted]", "root": "3f0i16", "reply_to": null, "timestamp": 1438166354, "text": "I was told I failed to signal at an intersection which I drive through every day. I found it odd that I would forget, so I looked at my dash cam footage and sure enough, I had my blinker on through the whole turn.\n\nThere's a chance that he may not have seen it, but it still sounds ridiculous that I'd get pulled over for that. I was let off with a warning.\n\nWhat sort of records are kept regarding warnings? And what might have been the reason for getting pulled over? Also, he was just on the other side into the next county over. Not sure if that makes any difference.\n\nIt doesn't feel very good to be lied to by an officer and be left wondering \"what the hell?\"", "meta": {"score": 1, "top_level_comment": null, "retrieved_on": 1440582174, "gilded": 0, "gildings": null, "subreddit": "AskACop", "stickied": false, "permalink": "/r/AskACop/comments/3f0i16/i_believe_an_officer_lied_to_me_about_why_i_was/", "author_flair_text": ""}}
{"id": "3f752q", "user": "Zellyfish", "root": "3f752q", "reply_to": null, "timestamp": 1438284621, "text": "", "meta": {"score": 2, "top_level_comment": null, "retrieved_on": 1440579076, "gilded": 0, "gildings": null, "subreddit": "AskACop", "stickied": false, "permalink": "/r/AskACop/comments/3f752q/what_is_the_reasoning_behind_all_of_these/", "author_flair_text": ""}}
{"id": "3ja0b3", "user": "316_123", "root": "3ja0b3", "reply_to": null, "timestamp": 1441145612, "text": "I was on Key Biscayne in March of 2012 and I got ticketed for not stopping at a stop sign (*316.123 [2][a]*). \n\nIt was the last night of my vacation before heading home to England. I did nothing about the ticket as I literally didn't have time and I basically just forgot about it.\n\nNow I'm looking at going to Texas in March/April next year.\n\nWill the unpaid ticket have any consequences for me? From what I can recall, the Officer said that I'd have a Florida Drivers License suspended or something (I don't have one?!). \n\nJust wondering if this is gonna bite me in the ass if I happen to get pulled over whilst in Texas, or if it's a minor enough offence/Statute of limitations that will mean I don't have to worry.\n\nAny advice appreciated.", "meta": {"score": 1, "top_level_comment": null, "retrieved_on": 1450825500, "gilded": 0, "gildings": null, "subreddit": "AskACop", "stickied": false, "permalink": "/r/AskACop/comments/3ja0b3/uk_citizen_looking_for_help_with_traffic_citation/", "author_flair_text": ""}}
{"id": "3lea33", "user": "j_ghost", "root": "3lea33", "reply_to": null, "timestamp": 1442553020, "text": "I have a little knowledge on how to clean handcuffs. Everything I've heard is either use WD40 or oil or graphite powder. Does it really matter which one I use? Is dust collecting because I use oil really that big of an issue? ", "meta": {"score": 1, "top_level_comment": null, "retrieved_on": 1450789017, "gilded": 0, "gildings": null, "subreddit": "AskACop", "stickied": false, "permalink": "/r/AskACop/comments/3lea33/handcuff_cleaning/", "author_flair_text": ""}}
{"id": "1fg2ck", "user": "InsanityWolfie", "root": "1fg2ck", "reply_to": null, "timestamp": 1370056725, "text": "I happen to own an antique revolver, from 1886. do I have to be 21 before I can register it as my own? ", "meta": {"score": 0, "top_level_comment": null, "retrieved_on": 1412290135, "gilded": 0, "gildings": null, "subreddit": "AskACop", "stickied": false, "permalink": "/r/AskACop/comments/1fg2ck/whats_the_laws_about_owning_a_handgun_before/", "author_flair_text": ""}}
{"id": "397cdc", "user": "Livadas", "root": "397cdc", "reply_to": null, "timestamp": 1433879708, "text": "", "meta": {"score": 1, "top_level_comment": null, "retrieved_on": 1440681147, "gilded": 0, "gildings": null, "subreddit": "AskACop", "stickied": false, "permalink": "/r/AskACop/comments/397cdc/have_you_ever_pulled_someone_over_to_interview/", "author_flair_text": ""}}
{"id": "3af4z9", "user": "[deleted]", "root": "3af4z9", "reply_to": null, "timestamp": 1434733001, "text": "I've been in many situations where this was the case.  I'll be driving behind a cop on the freeway and suddenly here comes a speeder.  Of course when they realize there's a cop on the road they won't pass but slow down until he exits or something.  So if you did notice someone coming in fast but then slowing down and staying behind you, what do you do?", "meta": {"score": 1, "top_level_comment": null, "retrieved_on": 1440660471, "gilded": 0, "gildings": null, "subreddit": "AskACop", "stickied": false, "permalink": "/r/AskACop/comments/3af4z9/what_do_you_do_when_you_know_someone_who_is/", "author_flair_text": ""}}
{"id": "5bjsq7", "user": "askacopthroaway", "root": "5bjsq7", "reply_to": null, "timestamp": 1478486572, "text": "Hello officers,\n\nRecently I was pulled over for a traffic violation during my commute to work. The officer pulled me over and said that I rolled a stop sign and was going 14 miles over the speed limit and cited me for both violations. When he was handing me the ticket and explaining my options for the ticket however, he made a big point about how I had a clean driving record and was very courteous/cooperative. He then said that if I decide to dispute the ticket, he would consider dropping the ticket violation and consider dropping the points for the stop sign violation. He gave me a smile, shook my hand, and walked away.  It was clear to me at the time that he was nudging me to that option.\n\nI was initially so relieved that I didn't have time to think about what had just happened and ask questions about what would happen next. Now that it's over I'm wondering what happens if I do choose to dispute the ticket ...does that mean I have to go to court and deny the citations in court in front of the officer? If so, would the officer be offended that I would do that? As I think about it more, would the officer even remember that he said this to me when the time comes? He mentioned that he was patrolling the area specifically because of residential complains about drivers in the area, so I'm sure he will have ticketed a number of drivers (especially so since most drivers go around that speed in the area and roll that particular 3 way intersection).\n\nAny thoughts? Also any idea why the officer just didn't give me a warning or cite 1 violation on the ticket, if he was planning on cutting me a break?\n\nAppreciate any insights...Thanks everyone.\n\nEDIT: Also forgot to mention I am in CA and there is an option for trial by declaration. Not sure if that makes a big difference...and whether showing up in court is better or not.", "meta": {"score": 1, "top_level_comment": null, "retrieved_on": 1484209617, "gilded": 0, "gildings": null, "subreddit": "AskACop", "stickied": false, "permalink": "/r/AskACop/comments/5bjsq7/nice_officer_tickets_me_and_nudges_me_to_dispute/", "author_flair_text": ""}}
{"id": "glu6w", "user": "BippyTheBeardless", "root": "glu6w", "reply_to": null, "timestamp": 1302304955, "text": "I respect cops, but I have frequently seen police cars driven without following driving rules, rarely signaling before a turn or change of lane. I have even been cut up by a police car. None of the times was the police vehicle going at all fast, or with flashing lights. Just whilst patrolling.  It gives a poor impression of the cops respect for the laws he/she is meant to be upholding and enforcing.  My experience of this is in Silicon Valley area of California.", "meta": {"score": 1, "top_level_comment": null, "retrieved_on": -1, "gilded": -1, "gildings": null, "subreddit": "AskACop", "stickied": false, "permalink": "/r/AskACop/comments/glu6w/why_dont_cops_use_their_turn_signals/", "author_flair_text": ""}}
{"id": "6abjdt", "user": "sakurarose20", "root": "6abjdt", "reply_to": null, "timestamp": 1494404993, "text": "Of course, I'm naive, and tonight, he grabbed me when I went outside. Thankfully this time, people were outside, and scared him off. But how can I keep this from happening again? I just want him to go away!\n\nEDIT: He's making threats now. What do I do?!?!?!", "meta": {"score": 1, "top_level_comment": null, "retrieved_on": 1497070024, "gilded": 0, "gildings": null, "subreddit": "AskACop", "stickied": false, "permalink": "/r/AskACop/comments/6abjdt/guy_who_has_raped_me_before_keeps_texting_from/", "author_flair_text": ""}}
{"id": "6b2j54", "user": "sliceofpisces", "root": "6b2j54", "reply_to": null, "timestamp": 1494742227, "text": "If I turn on gps before I call 911 can dispatch ping it? \nI have an address that proves tricky in the system every single time I call (I'm dealing with a meth lab next door so I've become a regular caller) and it's really frustrating to wait for them to figure out where I am (I give my exact address and they always have trouble). ", "meta": {"score": 1, "top_level_comment": null, "retrieved_on": 1497139147, "gilded": 0, "gildings": null, "subreddit": "AskACop", "stickied": false, "permalink": "/r/AskACop/comments/6b2j54/location/", "author_flair_text": ""}}
{"id": "6b5nx0", "user": "sliceofpisces", "root": "6b5nx0", "reply_to": null, "timestamp": 1494789223, "text": "Can you get in trouble if something on your id is wrong? \nMy boyfriend barely drives so I'm not overly concerned. With his last id the receptionist ended up putting our street name in with an o instead of an a. \nOn his current id it should say something like \"US highway --\" but they put \"us highway 45 --\" and the 45 is not even remotely relevant, we have no idea why it's there other than my boyfriend's atrocious handwriting. ", "meta": {"score": 1, "top_level_comment": null, "retrieved_on": 1497140690, "gilded": 0, "gildings": null, "subreddit": "AskACop", "stickied": false, "permalink": "/r/AskACop/comments/6b5nx0/license_typos/", "author_flair_text": ""}}
{"id": "6bjc1i", "user": "Maegaa", "root": "6bjc1i", "reply_to": null, "timestamp": 1494959755, "text": "Or what most people call \"urban exploration.\"", "meta": {"score": 1, "top_level_comment": null, "retrieved_on": 1497147441, "gilded": 0, "gildings": null, "subreddit": "AskACop", "stickied": false, "permalink": "/r/AskACop/comments/6bjc1i/how_much_trouble_would_i_realistically_get_into/", "author_flair_text": ""}}
{"id": "6c1j5n", "user": "thecouragesone", "root": "6c1j5n", "reply_to": null, "timestamp": 1495168522, "text": "I just got a new car here in Cali, yet my father doesn't like the paper plates that have the dealership on it so he took it off and left the old plates that have expired tags on it. Will I get in trouble for that.", "meta": {"score": 1, "top_level_comment": null, "retrieved_on": 1497156429, "gilded": 0, "gildings": null, "subreddit": "AskACop", "stickied": false, "permalink": "/r/AskACop/comments/6c1j5n/new_car_old_tags/", "author_flair_text": ""}}
{"id": "6cb1ho", "user": "jackberserk", "root": "6cb1ho", "reply_to": null, "timestamp": 1495295510, "text": "My question for any LEOs monitoring this channel is as follows:\nHow do you remain calm in an emergency situation? Specifically, how do you hide the fact that your adrenaline is running high and avoid startling or scaring people around you? \n\nThanks,\nJack ", "meta": {"score": 2, "top_level_comment": null, "retrieved_on": 1497161118, "gilded": 0, "gildings": null, "subreddit": "AskACop", "stickied": false, "permalink": "/r/AskACop/comments/6cb1ho/remaining_cool/", "author_flair_text": ""}}
{"id": "6d48xr", "user": "Kretek_Kreddit", "root": "6d48xr", "reply_to": null, "timestamp": 1495652660, "text": "This afternoon an apartment manager and a uniformed officer knocked on three or four on the corner of my building.   I'm curious what type of business is common when visiting an unspecified unit. \n\nIf they're looking for an individual they would only knock on one unit right?   There is no noise complaint going on at this time of day as everyone is working.   \n\nI was coming home while they were here and said hello and cracked a joke about door to door salesmen, they could've asked me then if they were looking for information right?  The manager said I was fine (#12) then knocked on #13.  As far as I could tell they just opened the doors to the empty apartments peaked in and moved on.  ", "meta": {"score": 1, "top_level_comment": null, "retrieved_on": 1497175567, "gilded": 0, "gildings": null, "subreddit": "AskACop", "stickied": false, "permalink": "/r/AskACop/comments/6d48xr/apartment_visits/", "author_flair_text": ""}}
{"id": "6dj1xf", "user": "[deleted]", "root": "6dj1xf", "reply_to": null, "timestamp": 1495826221, "text": "[deleted]", "meta": {"score": 1, "top_level_comment": null, "retrieved_on": 1497183042, "gilded": 0, "gildings": null, "subreddit": "AskACop", "stickied": false, "permalink": "/r/AskACop/comments/6dj1xf/got_my_first_speeding_ticket_what_actually_goes/", "author_flair_text": ""}}
{"id": "6ds77b", "user": "maxman007", "root": "6ds77b", "reply_to": null, "timestamp": 1495948695, "text": "I am from New York and moved to Seattle about 2 years ago.  I have a drivers license but haven't drove at all since I moved here.  I never took the time to get a new ID as I just assumed it didn't matter if I wasn't driving.  A friend of mine suggested that it is illegal for me to use my New York ID now since I have moved.  Just curious if I am in any real risk of breaking the law.", "meta": {"score": 1, "top_level_comment": null, "retrieved_on": 1497187577, "gilded": 0, "gildings": null, "subreddit": "AskACop", "stickied": false, "permalink": "/r/AskACop/comments/6ds77b/accurate_id/", "author_flair_text": ""}}
{"id": "5sxnfs", "user": "[deleted]", "root": "5sxnfs", "reply_to": null, "timestamp": 1486611130, "text": "[deleted]", "meta": {"score": 1, "top_level_comment": null, "retrieved_on": 1489524059, "gilded": 0, "gildings": null, "subreddit": "AskACop", "stickied": false, "permalink": "/r/AskACop/comments/5sxnfs/officers_how_often_do_you_respond_to_calls_with/", "author_flair_text": ""}}
{"id": "4v2vqb", "user": "[deleted]", "root": "4v2vqb", "reply_to": null, "timestamp": 1469738650, "text": "[deleted]", "meta": {"score": 1, "top_level_comment": null, "retrieved_on": 1472997048, "gilded": 0, "gildings": null, "subreddit": "AskACop", "stickied": false, "permalink": "/r/AskACop/comments/4v2vqb/can_i_carry_my_guns_on_my_apartment_balcony/", "author_flair_text": ""}}
{"id": "5o7qtw", "user": "[deleted]", "root": "5o7qtw", "reply_to": null, "timestamp": 1484528684, "text": "[removed]", "meta": {"score": 1, "top_level_comment": null, "retrieved_on": 1489439318, "gilded": 0, "gildings": null, "subreddit": "AskACop", "stickied": false, "permalink": "/r/AskACop/comments/5o7qtw/is_it_illegal_to_ride_a_bike_while_drunk/", "author_flair_text": ""}}
{"id": "5qdftl", "user": "[deleted]", "root": "5qdftl", "reply_to": null, "timestamp": 1485470932, "text": "[deleted]", "meta": {"score": 2, "top_level_comment": null, "retrieved_on": 1489477859, "gilded": 0, "gildings": null, "subreddit": "AskACop", "stickied": false, "permalink": "/r/AskACop/comments/5qdftl/if_i_got_into_an_accident_with_an_offduty_police/", "author_flair_text": ""}}
{"id": "3zsecv", "user": "curaneal", "root": "3zsecv", "reply_to": null, "timestamp": 1452121306, "text": "It is my understanding that it is allowed for a cop to lie in order to extract information or perform his duties in apprehending criminals. IE: \"If you tell me where the crack is, I'll go easy on you.\" when in fact there is no discretion as to the punishment on the part of officers. Similarly \"I know you have weed in there. Produce it or you're going to jail.\" when in fact you suspect weed, but aren't sure. So long as it's not coercion or entrapment, that's ok, right?\n\nWhich I'm for, by the way. Not judging here.\n\nI am wondering, hypothetically, as a writer who wants to make a story, how far can that lying go?\n\nIE: A hypothetical scumbag (say a child rapist, so we all know the person is awful) is hiding in a house. You KNOW they are in that house. The rapist is staying quiet and you can't see them, and they have some crony friends stopping you from entering because you lack a warrant and they own the house.\n\nLacking a warrant, can you say (lying) \"I have a warrant. Bring the child rapist out, or everything illegal you have in that house will be observed, recorded, and you will be punished.\" as a bluff?\n\nSimilarly, can you threaten deadly force where a normal citizen could not, lying? IE to a person who has no gun but committed a heinous crime: \"I see your gun! Come down out of that tree or I will shoot you.\" (playing off the fear of the police to peacefully resolve the situation, etc).\n\nI'm less talking about what you may or may not do when no one is looking to be effective police, because that's your business. I mean strictly legally speaking, is there anything that could get you in trouble for doing those things?", "meta": {"score": 1, "top_level_comment": null, "retrieved_on": 1454981784, "gilded": 0, "gildings": null, "subreddit": "AskACop", "stickied": false, "permalink": "/r/AskACop/comments/3zsecv/question_about_lying_in_pursuit_of_justice/", "author_flair_text": ""}}
{"id": "3zx7uh", "user": "HidingInPlainSight73", "root": "3zx7uh", "reply_to": null, "timestamp": 1452197042, "text": "So, how does he know my speed?  The guy in front was measured but I was not other than his visual \"same speed as\" assessment.\n\nHow in the hell is that legal and is there a defense for it??", "meta": {"score": 1, "top_level_comment": null, "retrieved_on": 1454984046, "gilded": 0, "gildings": null, "subreddit": "AskACop", "stickied": false, "permalink": "/r/AskACop/comments/3zx7uh/guy_in_front_of_me_clocked_as_speeding_lights_on/", "author_flair_text": ""}}
{"id": "42azpf", "user": "[deleted]", "root": "42azpf", "reply_to": null, "timestamp": 1453558901, "text": "[deleted]", "meta": {"score": 1, "top_level_comment": null, "retrieved_on": 1455024730, "gilded": 0, "gildings": null, "subreddit": "AskACop", "stickied": false, "permalink": "/r/AskACop/comments/42azpf/utah_i_received_a_possession_charge_last_night/", "author_flair_text": ""}}
{"id": "2rr6k5", "user": "deejayblast4me", "root": "2rr6k5", "reply_to": null, "timestamp": 1420734374, "text": "", "meta": {"score": 2, "top_level_comment": null, "retrieved_on": 1440978035, "gilded": 0, "gildings": null, "subreddit": "AskACop", "stickied": false, "permalink": "/r/AskACop/comments/2rr6k5/is_there_a_loophole_to_not_having_a_front_license/", "author_flair_text": ""}}
{"id": "2sjcca", "user": "FezzikTheGreat", "root": "2sjcca", "reply_to": null, "timestamp": 1421345327, "text": "Neighbors are filming other neighbors rolling through as stop sign and sending said video to the local police department.  The police have started issuing tickets based solely on that video evidence.  According to some residents the police chief has said that they are aware this practice is debatable wrong and anyone who complains but does not fight the ticket will have the charge dropped to a summary offense forgoing all points and some of the fine.\n\nIs any or all of this as wrong as it sounds?  To me both the ticketing and the lowering of the offense seems uncomfortably suspect.", "meta": {"score": 2, "top_level_comment": null, "retrieved_on": 1440964715, "gilded": 0, "gildings": null, "subreddit": "AskACop", "stickied": false, "permalink": "/r/AskACop/comments/2sjcca/neighbor_filming_traffic_violations_police/", "author_flair_text": ""}}
{"id": "2slx49", "user": "[deleted]", "root": "2slx49", "reply_to": null, "timestamp": 1421393201, "text": "So I'm looking to apply to the police dept in Austin TX. I'm 21 and plan to do an internship program first. I was looking through the application and noticed the extensive previous employment section. I have a had a lot of jobs because I move around quite a bit and I know that's a red flag. I'm particularly concerned, though, about my report from a previous employer. During my leaving the job he very much disliked me and has since accused me of stealing while I was there (I didn't). How badly will this affect me? Will I be able to explain any of it? I will have a number of good references.", "meta": {"score": 1, "top_level_comment": null, "retrieved_on": 1440963512, "gilded": 0, "gildings": null, "subreddit": "AskACop", "stickied": false, "permalink": "/r/AskACop/comments/2slx49/employment_background_check_questions/", "author_flair_text": ""}}
{"id": "2sw4m4", "user": "[deleted]", "root": "2sw4m4", "reply_to": null, "timestamp": 1421634436, "text": "I live in Los Angeles, CA and someone told me that police cannot legally pull over someone for something that occurred behind them. Is this true or not?\n\nMy thinking is, if you shoot a gun out of your window behind a cop, he/she will definitely turn around and, at the very least, pull you over.\n\nBut if it's a non-violent traffic infraction such as someone running a red light or maybe someone jaywalking across the street, would it be perfectly legal or not for a cop to pull them over and/or cite them if they happened to see it from their rear view mirror?", "meta": {"score": 2, "top_level_comment": null, "retrieved_on": 1440958690, "gilded": 0, "gildings": null, "subreddit": "AskACop", "stickied": false, "permalink": "/r/AskACop/comments/2sw4m4/can_cops_pull_over_someone_for_something_that/", "author_flair_text": ""}}
{"id": "2t7fwp", "user": "thisweeksblowjob", "root": "2t7fwp", "reply_to": null, "timestamp": 1421871007, "text": "This happened not too far from where I live. \n\n [This is the backstory](http://news.yahoo.com/video-shows-man-shot-jersey-police-raising-hands-150049422.html)\n\n[This is the video of what happened\n](https://www.youtube.com/watch?v=Q0gxbCg5_jk)\n\nIs there anything the officer should have done differently in this situation?", "meta": {"score": 2, "top_level_comment": null, "retrieved_on": 1440953292, "gilded": 0, "gildings": null, "subreddit": "AskACop", "stickied": false, "permalink": "/r/AskACop/comments/2t7fwp/deadly_police_altercation_is_there_anything_you/", "author_flair_text": ""}}
{"id": "2tg7j6", "user": "[deleted]", "root": "2tg7j6", "reply_to": null, "timestamp": 1422050429, "text": "I used to be a truck driver and obviously am used to driving using my side mirrors. In my car it's all that I use, and the rear view is tilted up because I hate headlights bouncing off the mirror and into my eyes. I'd like to remove the mirror entirely because while it's not a huge issue, I'd like the extra windshield real estate. I'm just not sure if this would get me pulled over or if I happened to get pulled over I'd end up ticketed or something. I'm in Massachusetts, couldn't really come across anything specific online. Thanks!", "meta": {"score": 1, "top_level_comment": null, "retrieved_on": 1440949142, "gilded": 0, "gildings": null, "subreddit": "AskACop", "stickied": false, "permalink": "/r/AskACop/comments/2tg7j6/whats_the_legality_of_removing_rear_view_mirror/", "author_flair_text": ""}}
{"id": "34h7j9", "user": "tempfile", "root": "34h7j9", "reply_to": null, "timestamp": 1430449545, "text": "I'm just finishing my school term, and I would like to use my newly found free time to do some volunteering. Any good organizations that non-police folks wouldn't know about ?", "meta": {"score": 2, "top_level_comment": null, "retrieved_on": 1440761520, "gilded": 0, "gildings": null, "subreddit": "AskACop", "stickied": false, "permalink": "/r/AskACop/comments/34h7j9/volunteering/", "author_flair_text": ""}}
{"id": "35avif", "user": "Lat86", "root": "35avif", "reply_to": null, "timestamp": 1431100416, "text": "I was recently pulled over and arrested in Will County, IL. I received a speeding ticket (16mph over i believe) and received a possession of drug equipment bail bond certificate. I was arrested and vehicle impounded. I got my car back and have a court date in a few weeks. Any help/advice on this type of situation would be immensely appreciated. I would be happy to answer questions too. Thanks", "meta": {"score": 2, "top_level_comment": null, "retrieved_on": 1440747498, "gilded": 0, "gildings": null, "subreddit": "AskACop", "stickied": false, "permalink": "/r/AskACop/comments/35avif/speeding_and_drug_equipment_in_will_county_il/", "author_flair_text": ""}}
{"id": "36t9e8", "user": "[deleted]", "root": "36t9e8", "reply_to": null, "timestamp": 1432249171, "text": "I've read that it varies... has to have been \"experimental\" use and 3-5 years since the last use (has been less than a year for me personally). \n\nI've also read certain drug use classified as hard drugs like cocaine, acid, and extacy (which I have done) instantly makes you not eligible. \n\nThere are other drugs I have used that aren't heroin, meth, or weed that makes me believe I might not qualify. I looked on the agencies website and they only use weed as an example and said lying will eliminate you automatically. \n\nSo... I'm looking to see if anyone has any knowledge about prior use. I just don't want to go through the whole process of the physical and all the other stuff just to get eliminated when I tell the my prior drug use ", "meta": {"score": 1, "top_level_comment": null, "retrieved_on": 1440721702, "gilded": 0, "gildings": null, "subreddit": "AskACop", "stickied": false, "permalink": "/r/AskACop/comments/36t9e8/would_prior_drug_use_instantly_disqualify_me_from/", "author_flair_text": ""}}
{"id": "3tchpq", "user": "Squirreljedi516", "root": "3tchpq", "reply_to": null, "timestamp": 1447882101, "text": "I've been wanting to start a car project for a while, and I finally have the means to finance it. I've tried to do research on what would be legal, and it seems if I weld up the frame myself I'd have to license/register it as a \"kit car\". I'd rather not start with a car frame since I'd like the end car to look similar to an Ariel Atom. My question is what should I do to make sure the car will be street legal?", "meta": {"score": 1, "top_level_comment": null, "retrieved_on": 1450653148, "gilded": 0, "gildings": null, "subreddit": "AskACop", "stickied": false, "permalink": "/r/AskACop/comments/3tchpq/building_a_car_in_nebraska/", "author_flair_text": ""}}
{"id": "ulk0t", "user": "Jehosh", "root": "ulk0t", "reply_to": null, "timestamp": 1338870039, "text": "I ask because I live in a small suburb just outside a larger city. Is it jurisdiction, federal back, anything like that? ", "meta": {"score": 2, "top_level_comment": null, "retrieved_on": -1, "gilded": -1, "gildings": null, "subreddit": "AskACop", "stickied": false, "permalink": "/r/AskACop/comments/ulk0t/whats_the_difference_between_the_city_police_and/", "author_flair_text": ""}}
{"id": "3fut7n", "user": "Wlcome2theFuture2015", "root": "3fut7n", "reply_to": null, "timestamp": 1438765615, "text": "  I am about to drive cross country, and I keep having anxiety about police interactions.  I am not a felon.  I have never been arrested.  I had one speeding ticket when i was 16, and no other offenses since.  I am 32.  All of my interactions with police including aiding in emergencies have been positive.  I have great respect for most LEOs.  I still just can't shake this horrible feeling...\n\nWhile most would tell me not to worry, i keep having anxiety about traffic stops gone bad.  I will not be transporting anything illegal, and have all intentions of setting my cruise at the speed limit, and following all traffic laws.  but...  There are still so many scary stories out there!  i've been pulled over before on made up reasons and let go.  I feel like my car (subaru wrx hatchback) might get a lot of attention, because of my window tint, low ride height, and also my Colorado plates might make me a target (we just legalized a drug most of the country still puts you in jail for).  \n\nThe whole reason i am driving is so that I can take our dogs (a beagle and a lab mix) to the beach with us.  This also concerns me given the horrible stories of officers shooting dogs.  \n\nIn all of my experiences with police officers I have to say that 90 percent of the time, they have been respectful, and did their job exactly as they should.  I have also had a few encounters where i have obviously been stereotyped and treated as a criminal, even while breaking no laws.  \n\nI don't know why i am so nervous this particular time, and I understand my rights during a traffic stop.\n\nI guess what i am asking is has it really gotten as bad as it seems out there?  The stories of civil asset forfeiture are just appalling.  \n\nIf i am pulled over, should I record the interaction, or is that just asking for it?\n\nI keep having this fear of being asked to be searched, and saying no, and the whole situation just blowing up (with the dogs getting excited etc).\n\nHas anyone made a cross country drive recently and had interactions with the police?\n\nDo an officers reading this have advice for handling a traffic stop, when NO other laws are being broken?\n\nthanks for anyone who reads this and has something to say to ease my anxiety.\n\n", "meta": {"score": 1, "top_level_comment": null, "retrieved_on": 1440567852, "gilded": 0, "gildings": null, "subreddit": "AskACop", "stickied": false, "permalink": "/r/AskACop/comments/3fut7n/driving_xcountry_is_my_fear_of_police_irrational/", "author_flair_text": ""}}
{"id": "3hwnin", "user": "[deleted]", "root": "3hwnin", "reply_to": null, "timestamp": 1440197473, "text": "", "meta": {"score": 1, "top_level_comment": null, "retrieved_on": 1440532785, "gilded": 0, "gildings": null, "subreddit": "AskACop", "stickied": false, "permalink": "/r/AskACop/comments/3hwnin/on_a_scale_from_carnie_to_accountant_how_much/", "author_flair_text": ""}}
{"id": "3ibic0", "user": "oTOXIC_MUFFINo", "root": "3ibic0", "reply_to": null, "timestamp": 1440500514, "text": "If I use self defense with an illegal weapon what would happen to me? like a switchblade stiletto, which in Michigan is (to my knowledge) illegal to own because it's a switchblade and a stabbing weapon. Would it just be confiscated, or would I be ticketed, or would I even face criminal charges?", "meta": {"score": 1, "top_level_comment": null, "retrieved_on": 1440525733, "gilded": 0, "gildings": null, "subreddit": "AskACop", "stickied": false, "permalink": "/r/AskACop/comments/3ibic0/hypothetical_situation/", "author_flair_text": ""}}
{"id": "4jzpoo", "user": "serumvisions__go_", "root": "4jzpoo", "reply_to": null, "timestamp": 1463615533, "text": "", "meta": {"score": 1, "top_level_comment": null, "retrieved_on": 1466470064, "gilded": 0, "gildings": null, "subreddit": "AskACop", "stickied": false, "permalink": "/r/AskACop/comments/4jzpoo/if_an_officer_is_dining_in_say_a_tavern_in/", "author_flair_text": ""}}
{"id": "3qc66j", "user": "[deleted]", "root": "3qc66j", "reply_to": null, "timestamp": 1445896782, "text": "[deleted]", "meta": {"score": 1, "top_level_comment": null, "retrieved_on": 1450704391, "gilded": 0, "gildings": null, "subreddit": "AskACop", "stickied": false, "permalink": "/r/AskACop/comments/3qc66j/is_this_proper_protocol_for_police_surveillance/", "author_flair_text": ""}}
{"id": "1c9qun", "user": "SurplusDebator", "root": "1c9qun", "reply_to": null, "timestamp": 1365864818, "text": "I have tried looking this up and can't seem to find it anywhere. Normally I'm a good driver but this past week picked up 2 written warnings for minor traffic violations.(same thing) Is there a limit you can get before your license is suspended? Is that a state law that depends on where you live or is it a national thing?", "meta": {"score": 1, "top_level_comment": null, "retrieved_on": 1412824340, "gilded": 0, "gildings": null, "subreddit": "AskACop", "stickied": false, "permalink": "/r/AskACop/comments/1c9qun/written_warnings_how_many_can_you_get_before/", "author_flair_text": ""}}
{"id": "6hdhff", "user": "Butt-Factory", "root": "6hdhff", "reply_to": null, "timestamp": 1497510743, "text": "We received word on Monday that my co-worker and friend was struck on his motorcycle in los angeles this past saturday and was killed. It was a stolen car.  The car has been found,  but the driver is at large.  \n\nMy question is about how the police proceed and release information. I have found NOTHING online about this accident,  which seems strange considering that much smaller crimes from around the same time are being reported on by local blogs and the LAPD. You would think that a fatal hit and run in Hollywood with the suspect at large would get a mention at least.  The only information I've received is from my employer and his family.  Does this seem fishy?", "meta": {"score": 2, "top_level_comment": null, "retrieved_on": 1500143474, "gilded": 0, "gildings": null, "subreddit": "AskACop", "stickied": false, "permalink": "/r/AskACop/comments/6hdhff/fatal_hit_and_run/", "author_flair_text": ""}}
{"id": "6hvpxx", "user": "Jigsaw82", "root": "6hvpxx", "reply_to": null, "timestamp": 1497732576, "text": "", "meta": {"score": 2, "top_level_comment": null, "retrieved_on": 1500152585, "gilded": 0, "gildings": null, "subreddit": "AskACop", "stickied": false, "permalink": "/r/AskACop/comments/6hvpxx/i_see_these_things_on_the_back_of_police_cars_all/", "author_flair_text": ""}}
{"id": "24l05v", "user": "iLprofitto", "root": "24l05v", "reply_to": null, "timestamp": 1399073552, "text": "Hi I'm writing a screen play and want to know what a real life LEO would do in this situation. \n\nA 17 year old female motorists is stopped on the side of the turnpike. \n\nState Trooper stops to see whats going on. \n\nDriver's younger sibling (male 8 yrs) is urinating *off the road* in the woods at the edge of the state highway... (Hypothetically in NJ)\n\nHow serious is this offense? What is the likelihood of a serious warning but no citation of any kind?", "meta": {"score": 2, "top_level_comment": null, "retrieved_on": 1441553811, "gilded": 0, "gildings": null, "subreddit": "AskACop", "stickied": false, "permalink": "/r/AskACop/comments/24l05v/can_an_8_year_old_be_sited_for_public_urination/", "author_flair_text": ""}}
{"id": "24uc54", "user": "pissed_off48", "root": "24uc54", "reply_to": null, "timestamp": 1399354575, "text": "So I got pulled over tonight for the first time in a long time. Everything went well the officers was super professional I was wrong, I'll take it, but as he approached I put both hands on the wheel and waited for him to ask for my license before I made any type of moves. I feel like that makes it easier on everyone involved and just wanted some feedback. Thanx", "meta": {"score": 2, "top_level_comment": null, "retrieved_on": 1441549393, "gilded": 0, "gildings": null, "subreddit": "AskACop", "stickied": false, "permalink": "/r/AskACop/comments/24uc54/what_do_you_prefer_when_approaching_a_vehicle/", "author_flair_text": ""}}
{"id": "25dn3o", "user": "[deleted]", "root": "25dn3o", "reply_to": null, "timestamp": 1399919068, "text": "I have a history of drug use, and wondering if this is going to hamper my chances of getting accepted. I've been clean for a year now, and it was pot.\n\nAlso, what else may harm someone that is applying?", "meta": {"score": 1, "top_level_comment": null, "retrieved_on": 1441540265, "gilded": 0, "gildings": null, "subreddit": "AskACop", "stickied": false, "permalink": "/r/AskACop/comments/25dn3o/wanting_to_be_an_officer_but/", "author_flair_text": ""}}
{"id": "26ma37", "user": "[deleted]", "root": "26ma37", "reply_to": null, "timestamp": 1401209752, "text": "(For states that require a front plate).\n\nI asked a cop whom I recently saw in a parking lot on duty and he told me 80% of the time ill get pulled over. I call bullshit on that since I haven't had my front plate on the bumper in 6 months and have gotten pulled over zero times.\n\nI live in NY if that helps.", "meta": {"score": 1, "top_level_comment": null, "retrieved_on": 1441338014, "gilded": 0, "gildings": null, "subreddit": "AskACop", "stickied": false, "permalink": "/r/AskACop/comments/26ma37/how_likely_would_you_actually_pull_over_someone/", "author_flair_text": ""}}
{"id": "2e1ui1", "user": "KThingy", "root": "2e1ui1", "reply_to": null, "timestamp": 1408506800, "text": "Hey everyone! So I'm currently having a Facebook debate with a friend of mine over this whole Michael Brown situation. I've floated the idea that because the man was so large, regular escalation of force guidelines might not apply. He believes that the an officer is obligated to try non-lethal means no matter the size of the suspect. Setting aside what coulda, shoulda, and did or did not happen during that incident,  it made me curious if a taser is as effective on a very large person as it would be on an average sized one. Also, any thoughts you escalation of force regarding super sized suspects would be appreciated. Thanks in advance,  and stay safe out there.", "meta": {"score": 2, "top_level_comment": null, "retrieved_on": 1441211208, "gilded": 0, "gildings": null, "subreddit": "AskACop", "stickied": false, "permalink": "/r/AskACop/comments/2e1ui1/taser_question/", "author_flair_text": ""}}
{"id": "1s12xq", "user": "[deleted]", "root": "1s12xq", "reply_to": null, "timestamp": 1386111109, "text": "This post is mainly directed to anyone with knowledge in the Law Enforcement field. \n\nI will be moving to Texas mid next year and contemplating wether or not I should go through with the police academy here in California. \n\nI want to be sure before I make the move. \n\nThanks!", "meta": {"score": 1, "top_level_comment": null, "retrieved_on": 1411518438, "gilded": 0, "gildings": null, "subreddit": "AskACop", "stickied": false, "permalink": "/r/AskACop/comments/1s12xq/does_texas_recognize_californias_post/", "author_flair_text": ""}}
{"id": "1s4smo", "user": "throwawaygunwhoa", "root": "1s4smo", "reply_to": null, "timestamp": 1386213619, "text": "I'd really like to talk in private over pm... id be really grateful, I just want to know what the laws are before I start owning weapons(guns)... thank you for your time\n\nObviously I cant give out too much info, not that you care\n\nI am in Ohio, I know that gun laws differ in each state.\n\nIm typing up a small questionair to give to a person that responds to me for organization purposes... and to save time ", "meta": {"score": 1, "top_level_comment": null, "retrieved_on": 1411512463, "gilded": 0, "gildings": null, "subreddit": "AskACop", "stickied": false, "permalink": "/r/AskACop/comments/1s4smo/alright_i_have_a_couple_questions_about_gun_laws/", "author_flair_text": ""}}
{"id": "1sootq", "user": "solarsailor_", "root": "1sootq", "reply_to": null, "timestamp": 1386815179, "text": "I'm just wondering if anyone knows how much I could get fined for this? Is it illegal? Or just frowned upon? What is an acceptable alternative to a front bumper that won't get me in trouble? My truck runs fine, but legalities are keeping me from being on the road. Help me, please.", "meta": {"score": 1, "top_level_comment": null, "retrieved_on": 1411482291, "gilded": 0, "gildings": null, "subreddit": "AskACop", "stickied": false, "permalink": "/r/AskACop/comments/1sootq/driving_with_no_front_bumper_in_tennessee/", "author_flair_text": ""}}
{"id": "5he75e", "user": "hooty88", "root": "5he75e", "reply_to": null, "timestamp": 1481295844, "text": "I inquire because I just found out my ex wife was pulled over some years ago and I just found it online. I'm just curious how much it ran her financially. Thanks in advance. ", "meta": {"score": 1, "top_level_comment": null, "retrieved_on": 1484383468, "gilded": 0, "gildings": null, "subreddit": "AskACop", "stickied": false, "permalink": "/r/AskACop/comments/5he75e/in_virginia_newport_news_area_if_im_clocked_going/", "author_flair_text": ""}}
{"id": "2o0iwv", "user": "whippetbadger21", "root": "2o0iwv", "reply_to": null, "timestamp": 1417493916, "text": "I live in western NC, and I have a rifle rack mounted to the roof of my truck. I've read the laws, but I want to make sure if its legal. The mount is at the back of the cab (double cab tundra) and I cant reach it from the drivers seat without effort. Is that good enough as is? unloaded ofcourse, but should I put on a lock as well? ", "meta": {"score": 2, "top_level_comment": null, "retrieved_on": 1441041811, "gilded": 0, "gildings": null, "subreddit": "AskACop", "stickied": false, "permalink": "/r/AskACop/comments/2o0iwv/carrying_rifle_in_vehicle_nc/", "author_flair_text": ""}}
{"id": "2o3cf8", "user": "C_schustey", "root": "2o3cf8", "reply_to": null, "timestamp": 1417560186, "text": "I was pulled over for running a yellow light. Cop told me that yellow and red are the same and to stop at both. I didn't have my license on me because I grabbed the wrong wallet. He asked if I was on the registration and went to his rig. He comes back with a ticket and we part ways. Later I read the ticket and it's written out to my wife who wasn't in the vehicle at the time. She's also black and I'm white so we're not easy confused. My question is, if I show for court with my wife how likely it is that it will get tossed out?", "meta": {"score": 2, "top_level_comment": null, "retrieved_on": 1441040436, "gilded": 0, "gildings": null, "subreddit": "AskACop", "stickied": false, "permalink": "/r/AskACop/comments/2o3cf8/ticketed_for_running_a_yellow_light_but_the/", "author_flair_text": ""}}
{"id": "2or6ta", "user": "GreatDeku", "root": "2or6ta", "reply_to": null, "timestamp": 1418133893, "text": "A mid-size car dealer has, within the past three months or so, made it a habit of parking two or three cars with dealer plates in front of my house and some of the neighbors' houses.  They will sit in the same spot for 1-2 weeks before they are finally moved and replaced with a different car from the dealership.  I sent an email to the dealership last week and haven't received a response.\n\nI understand that I do not own street parking out front of my house, but these car are becoming a slight (but bearable, I suppose) nuisance.\n\nIs there anything I can do to stop this?  Sorry if this comes off as whiny.", "meta": {"score": 2, "top_level_comment": null, "retrieved_on": 1441029173, "gilded": 0, "gildings": null, "subreddit": "AskACop", "stickied": false, "permalink": "/r/AskACop/comments/2or6ta/car_dealership_parking_vehicles_on_street_making/", "author_flair_text": ""}}
{"id": "2p2mkf", "user": "wilson535", "root": "2p2mkf", "reply_to": null, "timestamp": 1418386100, "text": "Let's say if you are arrested but have no ID, phone or anything like that and you refuse to give your name and address what can the police do?\n\nI'm asking about police in the UK specifically, but police from any other country are welcome to answer too.\n\nThanks!", "meta": {"score": 2, "top_level_comment": null, "retrieved_on": 1441023716, "gilded": 0, "gildings": null, "subreddit": "AskACop", "stickied": false, "permalink": "/r/AskACop/comments/2p2mkf/what_if_the_police_cant_identify_you/", "author_flair_text": ""}}
{"id": "2q1r73", "user": "greenguy415", "root": "2q1r73", "reply_to": null, "timestamp": 1419231468, "text": "", "meta": {"score": 0, "top_level_comment": null, "retrieved_on": 1441007086, "gilded": 0, "gildings": null, "subreddit": "AskACop", "stickied": false, "permalink": "/r/AskACop/comments/2q1r73/cnns_askacop_promo_gone_wrong_are_all_laws_worth/", "author_flair_text": ""}}
{"id": "c1ohq23", "user": "Iamsqueegee", "root": "glu6w", "reply_to": "glu6w", "timestamp": 1302305960, "text": "I'm less concerned by the turn signals than I am the beatings, rapes, and shootings. Maybe that's just me. ", "meta": {"score": -1, "top_level_comment": "c1ohq23", "retrieved_on": 1427050826, "gilded": 0, "gildings": null, "subreddit": "AskACop", "stickied": false, "permalink": "", "author_flair_text": ""}}
{"id": "c1ohqo6", "user": "BippyTheBeardless", "root": "glu6w", "reply_to": "c1ohq23", "timestamp": 1302306218, "text": "Maybe an occasional bent cop does such things. But good cops often drive like learners on patrol.", "meta": {"score": 1, "top_level_comment": "c1ohq23", "retrieved_on": 1427050835, "gilded": 0, "gildings": null, "subreddit": "AskACop", "stickied": false, "permalink": "", "author_flair_text": ""}}
{"id": "c1ohr9e", "user": "Iamsqueegee", "root": "glu6w", "reply_to": "c1ohqo6", "timestamp": 1302306439, "text": "Yeah, that might have been a bit strong in response to a turn signal query, but when I see cops nowadays I'm not wondering if they use their turn signals, only what laws do they sidestep because they wear a badge. ", "meta": {"score": 1, "top_level_comment": "c1ohq23", "retrieved_on": 1428204264, "gilded": 0, "gildings": null, "subreddit": "AskACop", "stickied": false, "permalink": "", "author_flair_text": ""}}
{"id": "c1ohtus", "user": "BippyTheBeardless", "root": "glu6w", "reply_to": "c1ohr9e", "timestamp": 1302307444, "text": "This is a new subreddit,  starting on a particularly accusatory tone would have been likely to put off any cop that might be willing to stick in this forum.  Getting onto the meatier issues after the group got up steam would seem the wisest idea.", "meta": {"score": 2, "top_level_comment": "c1ohq23", "retrieved_on": 1427050882, "gilded": 0, "gildings": null, "subreddit": "AskACop", "stickied": false, "permalink": "", "author_flair_text": ""}}
{"id": "c1ohwye", "user": "Iamsqueegee", "root": "glu6w", "reply_to": "c1ohtus", "timestamp": 1302308713, "text": "Sorry, I don't look to see how old a subreddit is before commenting. And don't often look to see what that subreddit is, either. It's caused me a bit of embarrassment when responding to a post in a trans-gender subreddit, so I try to look before responding. I use my phone when perusing the site and choose to look at all subreddits, so this changes the dynamic versus on a computer. Typically the posts people make steer my enthusiasm and responses. When I look at the 'New' posts and all I see is people pissing and moaning, I tend to respond in kind. When the flow of posts is more humorous or sarcastic, I follow suit. This isn't a rule, but generally how it goes. If I feel strongly about something and it goes against the vox populi, so be it. I'm not in it for the karma. When I read your post it struck me in a certain way and I responded. Thanks for taking the time to read this and I hope things go well with the new subreddit :)", "meta": {"score": 1, "top_level_comment": "c1ohq23", "retrieved_on": 1427050924, "gilded": 0, "gildings": null, "subreddit": "AskACop", "stickied": false, "permalink": "", "author_flair_text": ""}}
{"id": "c1oupyx", "user": "BippyTheBeardless", "root": "glu6w", "reply_to": "c1ohwye", "timestamp": 1302537706, "text": "Since no bites over the weekend, I'm guessing this subreddit is going to die a quick death. shame really, I'd also like to get onto meatier subjects of how police are self-policing themselves. How much corruption if any is ignored and what is never ignored...", "meta": {"score": 1, "top_level_comment": "c1ohq23", "retrieved_on": 1427057015, "gilded": 0, "gildings": null, "subreddit": "AskACop", "stickied": false, "permalink": "", "author_flair_text": ""}}
{"id": "c5qu85a", "user": "EvanM07", "root": "ulk0t", "reply_to": "ulk0t", "timestamp": 1344564430, "text": "Well first off let me start out by saying that I am not yet a police officer. I am currently in the police academy though and have many years of experience working with law enforcement as a police explorer and having many family members who are cops.\n\nThat disclaimer aside: This can vary by state. Typically a city police department is funded by the city government and patrols within the city limits and will assist officers/departments in surrounding cities if needed. \n\nSheriffs are typically (and I use typically for a reason) are funded by the county government and have jurisdiction over unincorporated areas within the county (land not belonging to a city government). They are also (usually) the higher law enforcement power in the county including within the jurisdiction of the cities within the county. (I know, this seems like a lot).\n\nThen you have either State Police or State Highway Patrol. Funded by the state government. Some states consider both to be the same thing, others like Ohio just have a Highway Patrol with no jurisdiction over anything other that highways and properties directly in correlation to the highways. Back when I lived in California (please any CHiPies correct me if I am wrong) the California Highway Patrol is not only just a state police division tasked with patrolling the highway but are also tasked with being the \"secret service\" if you will for the Governor of California. And they are also the highest form of law enforcement in the state. They set the standard for all law enforcement practices within California.\n\nNow in your case (depending on the city, county, state you live in) you may be like Los Angeles and its surrounding suburbs. A lot of the suburbs cannot afford to staff their own police department and therefore contract it out to the LAPD (Los Angeles Police Dept). Other areas further away from the Downtown part of LA do the same thing but with the Los Angeles County Sheriffs department. I lived in a city just outside of Los Angeles County and we had our own police dept, but the smaller city to the north east of mine had to contract out to the San Bernardino Couty Sheriffs Dept.\n\nSo it all really depends on what you see on the side of the cop cars in your area. Does it say the name of your city or something else? Do you see a lot of Sheriffs cars?\n\nWell I hope I answered that clearly enough. If not please let me know if there is anything I can clarify for you! ", "meta": {"score": 1, "top_level_comment": "c5qu85a", "retrieved_on": 1429598570, "gilded": 0, "gildings": null, "subreddit": "AskACop", "stickied": false, "permalink": "", "author_flair_text": ""}}
{"id": "c5qvzpa", "user": "Jehosh", "root": "ulk0t", "reply_to": "c5qu85a", "timestamp": 1344571364, "text": "Really appreciate it, thanks. This helps. ", "meta": {"score": 2, "top_level_comment": "c5qu85a", "retrieved_on": 1429599402, "gilded": 0, "gildings": null, "subreddit": "AskACop", "stickied": false, "permalink": "", "author_flair_text": ""}}
{"id": "cezlk38", "user": "[deleted]", "root": "1sootq", "reply_to": "1sootq", "timestamp": 1390778931, "text": "[deleted]", "meta": {"score": 1, "top_level_comment": "cezlk38", "retrieved_on": 1432119990, "gilded": 0, "gildings": null, "subreddit": "AskACop", "stickied": false, "permalink": "", "author_flair_text": ""}}
{"id": "chbm8gb", "user": "[deleted]", "root": "24uc54", "reply_to": "24uc54", "timestamp": 1399439625, "text": "[deleted]", "meta": {"score": 1, "top_level_comment": "chbm8gb", "retrieved_on": 1433686409, "gilded": 0, "gildings": null, "subreddit": "AskACop", "stickied": false, "permalink": "", "author_flair_text": ""}}
{"id": "cj7kfey", "user": "Frago242", "root": "2bnhk2", "reply_to": "2bnhk2", "timestamp": 1406306861, "text": "Went to court showed them my registration no fees were applied.", "meta": {"score": 1, "top_level_comment": "cj7kfey", "retrieved_on": 1434895359, "gilded": 0, "gildings": null, "subreddit": "AskACop", "stickied": false, "permalink": "", "author_flair_text": ""}}
{"id": "ckte9kr", "user": "Tallest_Waldo", "root": "2g1rl0", "reply_to": "2g1rl0", "timestamp": 1411762676, "text": "Disclaimer: Not a cop, and this is not legal advice- check your local laws and regulations.\n\nLate to reply, but I've asked this question to several friendly LEO's and the reply has been different each time.  \n\nThe consensus is that **theoretically** it should be legal to somehow signal to the officer that you understand you are being stopped (thumbs up out the window and hazards on etc), place a call to the local Police department politely stating that you are aware you are being stopped and are choosing to pull over in a populated area, and the dispatch should notify the officer of the situation.\n\nIn reality, every officer will react and respond to this differently, and you run the risk of unnecessarily aggravating an otherwise reasonable officer.\n\nTL;DR: You can, and it's probably legal, but there's a chance you will get harsher treatment because of it.  Best to just pull the hell over and hope for the best.", "meta": {"score": 1, "top_level_comment": "ckte9kr", "retrieved_on": 1426808603, "gilded": 0, "gildings": null, "subreddit": "AskACop", "stickied": false, "permalink": "", "author_flair_text": ""}}
{"id": "clb6wsv", "user": "LabRatArmsCo", "root": "2g1rl0", "reply_to": "2g1rl0", "timestamp": 1413477305, "text": "Cop Here: if you think something is not right don't pull over, call 911 let them know were you are and what car your in, hazards on, don't speed. go to wherever the person on 911 tells you. pullover turn your interior lights on grab the steering wheel with both hands and don't move around. \n\nit happens more then you think the 911 operator will ask if anyone is puling you over and if a legit cop answers then they will tell you its ok to pullover. we all understand that its for safety reasons and not to be elusive if its done in this manner. \n\non the off chance you get an asshole cop then i really doubt the DA will let the charges proceed once your lawyer talk to them. ", "meta": {"score": 5, "top_level_comment": "clb6wsv", "retrieved_on": 1426498822, "gilded": 0, "gildings": null, "subreddit": "AskACop", "stickied": false, "permalink": "", "author_flair_text": ""}}
{"id": "clb7et0", "user": "LabRatArmsCo", "root": "2e1ui1", "reply_to": "2e1ui1", "timestamp": 1413478206, "text": "&gt; Hey everyone! So I'm currently having a Facebook debate with a friend of mine over this whole Michael Brown situation. I've floated the idea that because the man was so large, regular escalation of force guidelines might not apply. He believes that the an officer is obligated to try non-lethal means no matter the size of the suspect. Setting aside what coulda, shoulda, and did or did not happen during that incident, it made me curious if a taser is as effective on a very large person as it would be on an average sized one. Also, any thoughts you escalation of force regarding super sized suspects would be appreciated. Thanks in advance, and stay safe out there.\n\nTasers are not always effective and not always able to be used. let me be clear for this next one. NO OFFICER IS OBLIGATED TO USE IT IN A DEADLY FORCE SITUATION. a person that is vastly larger then a cop is a deadly threat if charging them armed or not.\n\nas far as the effectiveness of the Taser it works on muscle mass, the spread of the Taser probes and a plethora of other factors. \n\nclothing can stop it, if the probes are too close its just pain not muscular interference, if the person has a lot of body fat that can stop it. bad placement can  render it useless, ect ect ect. the Taser is a great wonderful tool that has saved many people from getting hurt, police and suspects alike. but it is not a replacement for a gun and is not a deadly force tool. in my particular use of force its in between forceful talking and a baton. a asp baton is a harsher weapon as far as i am concerned, with much more capacity to cause harm. ", "meta": {"score": 2, "top_level_comment": "clb7et0", "retrieved_on": 1426498589, "gilded": 0, "gildings": null, "subreddit": "AskACop", "stickied": false, "permalink": "", "author_flair_text": ""}}
{"id": "clb7q9c", "user": "LabRatArmsCo", "root": "24l05v", "reply_to": "24l05v", "timestamp": 1413478766, "text": "Cant speak to NJ law but here is what i would do. \n\n1.stop to see if everything is all right. \n2. see 8 yo pee in the woods, let them finish.\n3. have conversation with driver to gather if the kid is not kidnapped in danger ect. wait on a warrant check while talking.\n4 if all is copacetic then talk to the driver about the rest stop thats down the road and how the side of the highway is a dangerous place for a kid.\n5. make sure they get back into traffic again safely.\n6 contemplate the universe, get donuts.", "meta": {"score": 3, "top_level_comment": "clb7q9c", "retrieved_on": 1426498440, "gilded": 0, "gildings": null, "subreddit": "AskACop", "stickied": false, "permalink": "", "author_flair_text": ""}}
{"id": "clb7t6m", "user": "LabRatArmsCo", "root": "24uc54", "reply_to": "24uc54", "timestamp": 1413478913, "text": "the only thing i would say to do differently is if at night turn on your overhead light. other then that thank you for acting right. you did everything perfectly. have an up vote for your good judgment.\n\n", "meta": {"score": 1, "top_level_comment": "clb7t6m", "retrieved_on": 1426498402, "gilded": 0, "gildings": null, "subreddit": "AskACop", "stickied": false, "permalink": "", "author_flair_text": ""}}
{"id": "clb7x06", "user": "LabRatArmsCo", "root": "2bnhk2", "reply_to": "2bnhk2", "timestamp": 1413479106, "text": "glad it got resolved. i will say to anyone else in this situation those types of tickets are often dismissed once the problem is fixed, they are almost a safeguard against the driver saying i promise to fix it and then not. whenever i have wrote one like this i always tell them that the can fix it and bring proof i will have the DA drop the charge. just a morning in court is enough of a punishment in my eyes. no money is needed. ", "meta": {"score": 2, "top_level_comment": "clb7x06", "retrieved_on": 1426498353, "gilded": 0, "gildings": null, "subreddit": "AskACop", "stickied": false, "permalink": "", "author_flair_text": ""}}
{"id": "clbkznh", "user": "KThingy", "root": "2e1ui1", "reply_to": "clb7et0", "timestamp": 1413502986, "text": "Thanks for the insight! I'm glad policy allows for proper use of force in these situations, I've said before I can't think of many valid reasons to lay hands on a cop, so I generally believe people that do deserve whatever they get. ", "meta": {"score": 1, "top_level_comment": "clb7et0", "retrieved_on": 1426491288, "gilded": 0, "gildings": null, "subreddit": "AskACop", "stickied": false, "permalink": "", "author_flair_text": ""}}
{"id": "clco7m2", "user": "LabRatArmsCo", "root": "2jj5qj", "reply_to": "2jj5qj", "timestamp": 1413604258, "text": "looks like he is pretty well hosed, \n\nPossess without license: first offense: up to two years in prison or jail, a fine of up to $500, or both. Subsequent offense:\n\n**up to** two years imprisonment, a fine of up to $1,000, or both.\n\nPossess a firearm without license outside of home or place of business: from 2.5 to five years imprisonment, or 18 months to 2.5 years in jail; with a **mandatory minimum of 18 months**\n\nwhat exactly was he charged with for the shooting of the gun? if its only a city ordinance violation then thats peanuts.if its another charge he may be looking at more time.\n\nMass. Gen. Laws Ann. ch. 140, § 129C; ch. 269, § 10\n\nas far as the Oxi pills ( OC 30s i assume are 30 mg oxicodone)\n\nFirst convictions for possessing class A, B, C, and D substances (excluding heroin) include a fine of up to $1,000, **up to** one year in jail, or both. \n\nSecond and subsequent convictions incur a fine of up to $2,000, up to two years in prison, or both.\n\nNot to mention if convicted he is now a registered felon, and that has to go on every job application, college application for ever. it is going to be very hard if not impossible to get a decent job after this. \n\n**if he is convicted, because after all he is innocent until proven guilty and judged guilty by a court.**\n\nit could all be box car sentencing, witch means that he has to do one after the other or he could get them all at the same time so he only serves the longest sentence. ", "meta": {"score": 1, "top_level_comment": "clco7m2", "retrieved_on": 1426472589, "gilded": 0, "gildings": null, "subreddit": "AskACop", "stickied": false, "permalink": "", "author_flair_text": ""}}
{"id": "clfn7sp", "user": "simmiauto246", "root": "2jj5qj", "reply_to": "clco7m2", "timestamp": 1413907301, "text": "today was his court date was he put somewhere for 18 mo?", "meta": {"score": 2, "top_level_comment": "clco7m2", "retrieved_on": 1426421655, "gilded": 0, "gildings": null, "subreddit": "AskACop", "stickied": false, "permalink": "", "author_flair_text": ""}}
{"id": "clftoru", "user": "LabRatArmsCo", "root": "2jj5qj", "reply_to": "clfn7sp", "timestamp": 1413918974, "text": "only if he pled guilty and received active time.\nits all up to the judge and the DA as to what is going to happen if convicted. he most likely got a trial date or a continuance. e court time coming. the time he is in jail may count to the conviction, so i really cant give you an answer due to all the variables.\n\nsorry. ", "meta": {"score": 1, "top_level_comment": "clco7m2", "retrieved_on": 1426418636, "gilded": 0, "gildings": null, "subreddit": "AskACop", "stickied": false, "permalink": "", "author_flair_text": ""}}
{"id": "clfzule", "user": "simmiauto246", "root": "2jj5qj", "reply_to": "clftoru", "timestamp": 1413930026, "text": "he couldn't really plead against it they printed it and it matched him", "meta": {"score": 1, "top_level_comment": "clco7m2", "retrieved_on": 1426415640, "gilded": 0, "gildings": null, "subreddit": "AskACop", "stickied": false, "permalink": "", "author_flair_text": ""}}
{"id": "cmpqwrl", "user": "twomoreandatinkle", "root": "2or6ta", "reply_to": "2or6ta", "timestamp": 1418137150, "text": "It would be a shame if the cars were keyed or something like that. ", "meta": {"score": 1, "top_level_comment": "cmpqwrl", "retrieved_on": 1425525310, "gilded": 0, "gildings": null, "subreddit": "AskACop", "stickied": false, "permalink": "", "author_flair_text": ""}}
{"id": "cn21c73", "user": "greenguy415", "root": "2q1r73", "reply_to": "2q1r73", "timestamp": 1419231492, "text": "These are hilarious!", "meta": {"score": 1, "top_level_comment": "cn21c73", "retrieved_on": 1425275765, "gilded": 0, "gildings": null, "subreddit": "AskACop", "stickied": false, "permalink": "", "author_flair_text": ""}}
{"id": "cntf0ux", "user": "Nateindahood", "root": "2rr6k5", "reply_to": "2rr6k5", "timestamp": 1421634570, "text": "I'd like to say if you have your license plate visible in your front window, then it's acceptable; but I don't think that's the case considering my personal experience.\n\nMy front bumper was ripped off of my car and so I stuck my license plate in the front window. I awoke the next morning to find a nice ticket for not displaying a front license plate.\n\nI see lots of people driving around with their license plate in their window, but I guess according to my experience, it's not as legal as it seems.\n\nEdit: I live in Los Angeles, CA", "meta": {"score": 1, "top_level_comment": "cntf0ux", "retrieved_on": 1424800720, "gilded": 0, "gildings": null, "subreddit": "AskACop", "stickied": false, "permalink": "", "author_flair_text": ""}}
{"id": "cntjma4", "user": "deejayblast4me", "root": "2rr6k5", "reply_to": "cntf0ux", "timestamp": 1421643477, "text": "Tha ks for the response.  Unfortunately the law says something to the effect of being securely mounted and visible from the front. That being said, resting it on the dash diagonally won't work. I thought of that first and then researched. I also live in LA county.", "meta": {"score": 1, "top_level_comment": "cntf0ux", "retrieved_on": 1424798439, "gilded": 0, "gildings": null, "subreddit": "AskACop", "stickied": false, "permalink": "", "author_flair_text": ""}}
{"id": "cnvp09r", "user": "BigCityCop", "root": "2sw4m4", "reply_to": "2sw4m4", "timestamp": 1421811609, "text": "That person has figured out our greatest weakness, crimes committed behind us. All joking aside I couldn't tell you how many times I've looked in my rear view mirror and seen someone doing something stupid and how quickly I can turn my patrol car around.", "meta": {"score": 2, "top_level_comment": "cnvp09r", "retrieved_on": 1424492449, "gilded": 0, "gildings": null, "subreddit": "AskACop", "stickied": false, "permalink": "", "author_flair_text": ""}}
{"id": "cnvqmqv", "user": "Nateindahood", "root": "2sw4m4", "reply_to": "cnvp09r", "timestamp": 1421814642, "text": "I know it seemed strange to ask; glad I finally got an answer from someone who does the job. Thanks!", "meta": {"score": 1, "top_level_comment": "cnvp09r", "retrieved_on": 1424491624, "gilded": 0, "gildings": null, "subreddit": "AskACop", "stickied": false, "permalink": "", "author_flair_text": ""}}
{"id": "cnwy8n9", "user": "refboy4", "root": "2p2mkf", "reply_to": "2p2mkf", "timestamp": 1421905686, "text": "In the U.S.\n\nYou said they were arrested, so they would be going to jail anyway. At the jail, they can run fingerprints and a few other things (facial recognition of mugshots is catching on slowly). If the fingerprints don't come up with a match, and you still refuse to comply, you just get to sit there until you change your mind. I've seen cases where a guy sat for almost a week in jail because he refused, and he wasn't a local so nobody knew him. He went to court, the court ordered him to ID himself. He refused, and sat in jail on contempt of court for awhile.\n\nIf not under arrest: what would happen usually depends on what the stop is for. If the officer has nothing but reasonable suspicion and can't turn it into anything more, they would legally have to let you go. Some states require you to identify yourself when ordered by a police officer with reasonable suspicion (that you have, are, or are about to commit a crime). The law in CO requires you to give a name and address (yes address not DOB). If you still refuse, you get arrested for obstruction, and the same thing as above happens.", "meta": {"score": 1, "top_level_comment": "cnwy8n9", "retrieved_on": 1424470803, "gilded": 0, "gildings": null, "subreddit": "AskACop", "stickied": false, "permalink": "", "author_flair_text": ""}}
{"id": "cnwyhso", "user": "refboy4", "root": "2nd1cg", "reply_to": "2nd1cg", "timestamp": 1421906300, "text": "If CO law applied:\n\nYou would be on trial for attempted murder, at the very least first degree assault. You would most likely lose.\n\nThe want for retrieving possessions and apprehending a criminal does not give you the right to use lethal force against someone. Lethal force is to protect your life. It is legal in situations where you are in imminent danger of death or serious bodily injury. The point at which the robber decided to run away, made it not life threatening to you.\n\nIf he died, your are on trial for second degree murder.", "meta": {"score": 1, "top_level_comment": "cnwyhso", "retrieved_on": 1424470685, "gilded": 0, "gildings": null, "subreddit": "AskACop", "stickied": false, "permalink": "", "author_flair_text": ""}}
{"id": "cnwyz7f", "user": "refboy4", "root": "2t7fwp", "reply_to": "2t7fwp", "timestamp": 1421907569, "text": "For one, they set up a crossfire when the second cop rolls in. If either one fires and misses it goes straight through to the other officer.\n\nEven with weapons involved and adrenaline pumping, throwing out f-bombs and other profanities just makes you look stupid and unprofessional. It makes you look like you've completely lost control, and at this point I'd say he did.\n\nSecondly, the cover officer got distracted by the scene with the passenger when he should have been zoned in on the driver. So because he stopped paying attention the driver can do all kinds of things.\n\nAs far as the passenger reaching for something, you can't see in this video. Maybe he did and the shoot was completely justified. Maybe if the first officer didn't' lose control of his emotions this would've never happened.\n\nA simple (not shouting but forceful) \"Put your hands on your face, if you move at all I will shoot you. Do you understand\" is very clear in what is going to happen when that person moves. At that point, you would be golden when you have to explain it in court. \"I told him I would shoot him if he moves, and he moved.\"\n\nI'm not going to go into detail about tactics, but my academy taught a way to get people out of a car with two officers (as we have here) without ever having any suspect not covered with lethal. You get them out of the car and away from weapons there, search them for easily accessible weapons, handcuff them, and then collect/ deal with the weapons in the car.\n\nThe second the primary officer drew his gun and started yelling profanities, he lost control of this situation.", "meta": {"score": 1, "top_level_comment": "cnwyz7f", "retrieved_on": 1424470459, "gilded": 0, "gildings": null, "subreddit": "AskACop", "stickied": false, "permalink": "", "author_flair_text": ""}}
{"id": "cnwz0ev", "user": "SithLordDarthRevan", "root": "2nd1cg", "reply_to": "cnwyhso", "timestamp": 1421907659, "text": "So I've got to hit him when he first attempts the robbery. ", "meta": {"score": 1, "top_level_comment": "cnwyhso", "retrieved_on": 1424470444, "gilded": 0, "gildings": null, "subreddit": "AskACop", "stickied": false, "permalink": "", "author_flair_text": ""}}
{"id": "cnwz0zg", "user": "refboy4", "root": "2sjcca", "reply_to": "2sjcca", "timestamp": 1421907698, "text": "It sounds like the police department is asking for a class action lawsuit filed with all the ticket recipients named as plaintiffs...", "meta": {"score": 1, "top_level_comment": "cnwz0zg", "retrieved_on": 1424470437, "gilded": 0, "gildings": null, "subreddit": "AskACop", "stickied": false, "permalink": "", "author_flair_text": ""}}
{"id": "cnwz37c", "user": "refboy4", "root": "2nd1cg", "reply_to": "cnwz0ev", "timestamp": 1421907866, "text": "If the guy makes a threat to your life, produces, or represents that he has a weapon, then you would be fine.\n\nOtherwise, you life or bodily integrity is not threatened and you are still on the hook for attempt/ murder.\n\n", "meta": {"score": 1, "top_level_comment": "cnwyhso", "retrieved_on": 1424470407, "gilded": 0, "gildings": null, "subreddit": "AskACop", "stickied": false, "permalink": "", "author_flair_text": ""}}
{"id": "cnwz6p5", "user": "SithLordDarthRevan", "root": "2nd1cg", "reply_to": "cnwz37c", "timestamp": 1421908132, "text": "Gotcha. Thanks. ", "meta": {"score": 1, "top_level_comment": "cnwyhso", "retrieved_on": 1424470363, "gilded": 0, "gildings": null, "subreddit": "AskACop", "stickied": false, "permalink": "", "author_flair_text": ""}}
{"id": "cnwz73l", "user": "refboy4", "root": "2e1ui1", "reply_to": "clbkznh", "timestamp": 1421908163, "text": "&gt;deserve whatever they get\n\nWe have to be careful though. Laying hands on a cop does not in any way justify \"whatever they get\". Does it merit a rather unpleasant response? Absolutely? Does it merit an ass whooping? Absolutely not. I know more than one cop who thinks it does.\n\nWe (the public in general) have to be very careful what we will tolerate. A cop should be able to defend themselves and be able to control suspects. A cop should not be allowed to beat the shit out of someone because they got offended that someone would challenge the police.", "meta": {"score": 1, "top_level_comment": "clb7et0", "retrieved_on": 1424470358, "gilded": 0, "gildings": null, "subreddit": "AskACop", "stickied": false, "permalink": "", "author_flair_text": ""}}
{"id": "cnx1d7n", "user": "FezzikTheGreat", "root": "2sjcca", "reply_to": "cnwz0zg", "timestamp": 1421915995, "text": "Can you give me specifics on why you think that?  I'm getting a ton of conflicting opinions on this", "meta": {"score": 1, "top_level_comment": "cnwz0zg", "retrieved_on": 1424469314, "gilded": 0, "gildings": null, "subreddit": "AskACop", "stickied": false, "permalink": "", "author_flair_text": ""}}
{"id": "cnxziig", "user": "refboy4", "root": "2sjcca", "reply_to": "cnx1d7n", "timestamp": 1421986450, "text": "Most places only allow tickets for traffic violations to be issued only if the officer personally witnessed the violation. Video evidence is not personally witnessing the event, so they are knowingly writing illegal tickets.", "meta": {"score": 1, "top_level_comment": "cnwz0zg", "retrieved_on": 1424443850, "gilded": 0, "gildings": null, "subreddit": "AskACop", "stickied": false, "permalink": "", "author_flair_text": ""}}
{"id": "cohu1it", "user": "awfulbeans", "root": "2vhz5a", "reply_to": "2vhz5a", "timestamp": 1423628912, "text": "Followup: I called American Express and explained the situation. They were able to find the card with just the name and state. Turns out the card had not been reported stolen (they cancelled the card once they found the account, and will contact the account holder in the morning). They said he should return the TV, and the refund should still go through. Beyond that, they claim worst case he'll be on the hook for the dinner he bought.\n\nHopefully that's how it works out. I expect I'll be hearing from them myself at some point. The CSR said in all his years, he'd never had a call like that, thanked me for reporting it, etc.", "meta": {"score": 1, "top_level_comment": "cohu1it", "retrieved_on": 1424524642, "gilded": 0, "gildings": null, "subreddit": "AskACop", "stickied": false, "permalink": "", "author_flair_text": ""}}
{"id": "cqi9561", "user": "hunterb404", "root": "336wxy", "reply_to": "336wxy", "timestamp": 1429509652, "text": "Ya do what you can mostly. Hopefully they have a belt on and you can cuff their hand to the belt or belt loop. Pretty easy to tear a belt loop though", "meta": {"score": 1, "top_level_comment": "cqi9561", "retrieved_on": 1432492720, "gilded": 0, "gildings": null, "subreddit": "AskACop", "stickied": false, "permalink": "", "author_flair_text": ""}}
{"id": "cqilalt", "user": "refboy4", "root": "336wxy", "reply_to": "336wxy", "timestamp": 1429545834, "text": "Figure out what will work. I've done a flex cuff to a waist belt (made from a nylon webbing type hobble) behind the back before.", "meta": {"score": 1, "top_level_comment": "cqilalt", "retrieved_on": 1432498586, "gilded": 0, "gildings": null, "subreddit": "AskACop", "stickied": false, "permalink": "", "author_flair_text": ""}}
{"id": "cr64b89", "user": "[deleted]", "root": "308soy", "reply_to": "308soy", "timestamp": 1431391457, "text": "[deleted]", "meta": {"score": 1, "top_level_comment": "cr64b89", "retrieved_on": 1432905568, "gilded": 0, "gildings": null, "subreddit": "AskACop", "stickied": false, "permalink": "", "author_flair_text": ""}}
{"id": "cr64mrd", "user": "[deleted]", "root": "2xd7e2", "reply_to": "2xd7e2", "timestamp": 1431392028, "text": "[deleted]", "meta": {"score": 2, "top_level_comment": "cr64mrd", "retrieved_on": 1432905720, "gilded": 0, "gildings": null, "subreddit": "AskACop", "stickied": false, "permalink": "", "author_flair_text": ""}}
{"id": "crh1t74", "user": "LabRatArmsCo", "root": "36t9e8", "reply_to": "36t9e8", "timestamp": 1432261874, "text": "As a general rule yes, yes it would. Any use of drugs harder then weed is a instant no go. ", "meta": {"score": 1, "top_level_comment": "crh1t74", "retrieved_on": 1433200293, "gilded": 0, "gildings": null, "subreddit": "AskACop", "stickied": false, "permalink": "", "author_flair_text": ""}}
{"id": "ctt72uc", "user": "Johnnynukemall", "root": "3fut7n", "reply_to": "3fut7n", "timestamp": 1438832485, "text": "Im not a cop anymore but just take it easy man. Most of what you see online is scare tactics. No one is out to ruin their career to fuck with you. The only thing I'd recommend is to tie up your dogs just for safety. Enjoy your trip. ", "meta": {"score": 1, "top_level_comment": "ctt72uc", "retrieved_on": 1440310489, "gilded": 0, "gildings": null, "subreddit": "AskACop", "stickied": false, "permalink": "", "author_flair_text": ""}}
{"id": "cttkk2u", "user": "Wlcome2theFuture2015", "root": "3fut7n", "reply_to": "3fut7n", "timestamp": 1438870825, "text": "thanks for the advice.  I will find a way to tie the dogs up in the back.", "meta": {"score": 1, "top_level_comment": "cttkk2u", "retrieved_on": 1440316974, "gilded": 0, "gildings": null, "subreddit": "AskACop", "stickied": false, "permalink": "", "author_flair_text": ""}}
{"id": "cupizn1", "user": "gnomey5678", "root": "3ja0b3", "reply_to": "3ja0b3", "timestamp": 1441305057, "text": "Ok, I don't know how drivers licences work for foreigners but in short when you got the ticket it was an agreement that you will go to the courthouse to dispute your charge (or just pay the fine) and if you don't do any of those you are automatically found guilty, in florida they typically suspend your drivers licence but the judge can do whatever he/she feels best so I we can't tell you exactly what will happen.\n\nWe can't tell you because every judge is different, but you should be fine if you never go to Florida.", "meta": {"score": 1, "top_level_comment": "cupizn1", "retrieved_on": 1444151844, "gilded": 0, "gildings": null, "subreddit": "AskACop", "stickied": false, "permalink": "", "author_flair_text": ""}}
{"id": "cv1fwn9", "user": "Palirroia", "root": "3ja0b3", "reply_to": "3ja0b3", "timestamp": 1442257299, "text": "You'll probably need to speak to someone more familiar with Florida's system. The absolute worst case scenario is that a warrant is issued against you for failing to appear in court. If you get pulled over in Texas, that warrant should flag up on their system and you'll likely end up arrested.\n\nBest case scenario is that you can't get a Florida driver's license until you pay your fine/go to court. In fact, you would probably be unable to get a US license from any state, as the DMVs (US equivalent of DVLA) tend to communicate with each other, until you sort this out.\n\nYou've already been cited, statute of limitations doesn't apply.\n\nYour best bet is to pay the fine. I'm not familiar with Florida, but in other jurisdictions you can pay traffic fines over the phone. Worth looking into.", "meta": {"score": 1, "top_level_comment": "cv1fwn9", "retrieved_on": 1444359821, "gilded": 0, "gildings": null, "subreddit": "AskACop", "stickied": false, "permalink": "", "author_flair_text": ""}}
{"id": "cv6ogdu", "user": "EvanM07", "root": "3lea33", "reply_to": "3lea33", "timestamp": 1442639510, "text": "Former cop here: I never actually cleaned mine. I would disinfect them after use but no detailed cleaning. Would just use them till they looked like they weren't going to work anymore and bough a new pair. They're only $20-$40. \n\n*Edit: I should also note than I carried two pair on my belt and 3 additional pair in the car usually on the spotlight handle.", "meta": {"score": 1, "top_level_comment": "cv6ogdu", "retrieved_on": 1444452650, "gilded": 0, "gildings": null, "subreddit": "AskACop", "stickied": false, "permalink": "", "author_flair_text": ""}}
{"id": "cv6wnbf", "user": "j_ghost", "root": "3lea33", "reply_to": "cv6ogdu", "timestamp": 1442671647, "text": "Thanks", "meta": {"score": 1, "top_level_comment": "cv6ogdu", "retrieved_on": 1444456575, "gilded": 0, "gildings": null, "subreddit": "AskACop", "stickied": false, "permalink": "", "author_flair_text": ""}}
{"id": "cv8rcwq", "user": "EvanM07", "root": "3ibic0", "reply_to": "3ibic0", "timestamp": 1442813850, "text": "Not too familiar with Michigan laws but from my experience it would depend on the officer wether or not they wanted to charge you. Also would depend on the nature of the encounter you had with the person, the injuries you sustained, the injuries you inflicted upon the person, and whether or not you can prove without a doubt that it was indeed self defense. You can 100% expect to be told to drop the weapon and to be placed in police custody while it is being investigated. ", "meta": {"score": 2, "top_level_comment": "cv8rcwq", "retrieved_on": 1444488480, "gilded": 0, "gildings": null, "subreddit": "AskACop", "stickied": false, "permalink": "", "author_flair_text": ""}}
{"id": "cv8rfgs", "user": "EvanM07", "root": "3f752q", "reply_to": "3f752q", "timestamp": 1442814065, "text": "I got out before this started happening so I have no idea except for the few times I was able to drive around in the supervisors Chevy Tahoe once. I have no idea why the switch is being made and I really don't care for the way the new Ford Interceptor SUV's look. I would much rather the sedan style from Ford as my department had a few and I loved it. ", "meta": {"score": 2, "top_level_comment": "cv8rfgs", "retrieved_on": 1444488514, "gilded": 0, "gildings": null, "subreddit": "AskACop", "stickied": false, "permalink": "", "author_flair_text": ""}}
{"id": "cvno3wm", "user": "courtneygraley009", "root": "3fut7n", "reply_to": "3fut7n", "timestamp": 1443957729, "text": "Speeding ticket is normally a civil offense, unless it involves something like negligent homicide, which becomes criminal. I think a [speeding ticket](http://www.missouriticketlawyer.com/local-traffic-law-info/kansas-city-area/), or running a stop sign is a civil offense. They have traffic courts for simple traffic violations, including DUI's. It can get tricky, if the offenses continue.", "meta": {"score": 1, "top_level_comment": "cvno3wm", "retrieved_on": 1446761357, "gilded": 0, "gildings": null, "subreddit": "AskACop", "stickied": false, "permalink": "", "author_flair_text": ""}}
{"id": "czji18n", "user": "untamed_skittle", "root": "3zx7uh", "reply_to": "3zx7uh", "timestamp": 1454312643, "text": "My radar unit has a range feature.  I often will get a car speeding then notice the one coming behind him is going even faster.  Push the fastest button and I now know both peoples speeds.  Odd though that he would conduct two stops at once.", "meta": {"score": 1, "top_level_comment": "czji18n", "retrieved_on": 1458214940, "gilded": 0, "gildings": null, "subreddit": "AskACop", "stickied": false, "permalink": "", "author_flair_text": ""}}
{"id": "czji2vw", "user": "untamed_skittle", "root": "3vrmlf", "reply_to": "3vrmlf", "timestamp": 1454312798, "text": "Sure give it to them.  Or find out his address maybe from his license and mail it to him.", "meta": {"score": 1, "top_level_comment": "czji2vw", "retrieved_on": 1458214961, "gilded": 0, "gildings": null, "subreddit": "AskACop", "stickied": false, "permalink": "", "author_flair_text": ""}}
{"id": "czjnn5v", "user": "HidingInPlainSight73", "root": "3zx7uh", "reply_to": "czji18n", "timestamp": 1454333347, "text": "Thanks for that.   Radar isn't allowed here.  I can't remember why, but only vascar, which makes it even more ridiculous to me.  ", "meta": {"score": 1, "top_level_comment": "czji18n", "retrieved_on": 1458217653, "gilded": 0, "gildings": null, "subreddit": "AskACop", "stickied": false, "permalink": "", "author_flair_text": ""}}
{"id": "d0ssmit", "user": "fourthnorth", "root": "3zsecv", "reply_to": "3zsecv", "timestamp": 1457486140, "text": "No. There are certain things police can lie about, and other things they cannot.\n\nAn officer cannot offer deals or promises- if they do and dont follow through then testimony extracted can be thrown out.\n\nFor instance- an officer can't say \"Tell me what you stole and I will only charge you with petit larceny\" and then charge you with grand larceny.\n\nAn officer can say \"Tell me what you stole, and I will tell the prosecutor how honest you were with me.\"\n\nThe other scenarios are just a little preposterous- if someo e is in a tree and wont come down, the police will either get a ladder truck to go get them, or wait for them to comw down. \n\nIn the other scenario, If the police have articuable facts a rapist is hiding in a house, they will just put it under surveillance and secure a warrant.", "meta": {"score": 1, "top_level_comment": "d0ssmit", "retrieved_on": 1460523282, "gilded": 0, "gildings": null, "subreddit": "AskACop", "stickied": false, "permalink": "", "author_flair_text": ""}}
{"id": "d0ywgrj", "user": "fourthnorth", "root": "3w8hju", "reply_to": "3w8hju", "timestamp": 1457922302, "text": "Depends on the state, and what their laws on possession, storage, and transport of firearms are.", "meta": {"score": 1, "top_level_comment": "d0ywgrj", "retrieved_on": 1460628801, "gilded": 0, "gildings": null, "subreddit": "AskACop", "stickied": false, "permalink": "", "author_flair_text": ""}}
{"id": "d18qlhj", "user": "Caleb33", "root": "48vb57", "reply_to": "48vb57", "timestamp": 1458617223, "text": "My opinion is they were messing with you. \n\nThe law isn't perfect, sometimes we get the wrong guy, however someone being arrested for looking similar to a bad guy is exceedingly unlikely. ", "meta": {"score": 1, "top_level_comment": "d18qlhj", "retrieved_on": 1460798862, "gilded": 0, "gildings": null, "subreddit": "AskACop", "stickied": false, "permalink": "", "author_flair_text": ""}}
{"id": "d1ds9q2", "user": "refboy4", "root": "4bzhdb", "reply_to": "4bzhdb", "timestamp": 1458959795, "text": "Its a holster for nunchucks. [Yes there are some arrest control techniques that use nunchucks.](https://www.google.com/webhp?sourceid=chrome-instant&amp;ion=1&amp;espv=2&amp;ie=UTF-8#q=nunchucks+arrest+control)", "meta": {"score": 1, "top_level_comment": "d1ds9q2", "retrieved_on": 1460885982, "gilded": 0, "gildings": null, "subreddit": "AskACop", "stickied": false, "permalink": "", "author_flair_text": ""}}
{"id": "d3py4s4", "user": "Echojhawke", "root": "4jzpoo", "reply_to": "4jzpoo", "timestamp": 1464664111, "text": "Not a cop, but absolutely. In fact, the cop would most likely follow the drinker out to make sure he's not getting into the drivers seat of a car. The laws are there for logic, not because they want to screw over people who drink. It's to make sure that accidents don't occur. ", "meta": {"score": 1, "top_level_comment": "d3py4s4", "retrieved_on": 1466207254, "gilded": 0, "gildings": null, "subreddit": "AskACop", "stickied": false, "permalink": "", "author_flair_text": ""}}
{"id": "d74qu01", "user": "Retrogaymer", "root": "4zei90", "reply_to": "4zei90", "timestamp": 1472688305, "text": "A week and absolute 0 reason has been given why I might be wrong. So, I was a fool to question what experience has taught me, that corrupt cops can't possibly be a minority?", "meta": {"score": 1, "top_level_comment": "d74qu01", "retrieved_on": 1475216089, "gilded": 0, "gildings": null, "subreddit": "AskACop", "stickied": false, "permalink": "", "author_flair_text": ""}}
{"id": "d7oxntp", "user": "Tarheel_50", "root": "4zei90", "reply_to": "4zei90", "timestamp": 1474007577, "text": "I don't think this is a very active sub, based on the volume of posts. I just stumbled across it today myself, and will respond as best as I can.\n\nI am an officer, and have been on the job for about 15 years now. I don't know what experiences you may have had, but in my experience 99%+ of officers are fine folks, trying their best to do a tough job. Most of what we do goes unseen, but when someone disgraces the uniform it's plastered on every media outlet.\n\nMy best advice is seek counseling and to proactively seek out opportunities to positively interact with the police. You'll quickly see that are just normal folks, and that the overwhelming majority officers are not corrupt. The truth is that we, more than anyone, despise the &lt;1% of those \"officers\" who betray their badge as their solitary actions reflect on the rest of us who take pride in serving with integrity.", "meta": {"score": 1, "top_level_comment": "d7oxntp", "retrieved_on": 1475728058, "gilded": 0, "gildings": null, "subreddit": "AskACop", "stickied": false, "permalink": "", "author_flair_text": ""}}
{"id": "d7oxyzz", "user": "Tarheel_50", "root": "4o5kf3", "reply_to": "4o5kf3", "timestamp": 1474008470, "text": "I'm not a Texas officer, but I am an officer in another Southern state.\n\nHere it doesn't matter if its the bulb, lens, or reflector is red - it is the color of light emitted. In the linked video the light is very red &amp; would likely get you ticketed (or arrested). YMMV.\n\nI did a quick Google &amp; found Texas statute Sec. 547.305 (b) which states \"Except as expressly authorized by law, a person may not operate or move equipment or a vehicle, other than a police vehicle, with a lamp or device that displays a red light visible from directly in front of the center of the equipment or vehicle.\"\n\nAs I read this, Texas also cares about the color of light emitted as opposed to the means to which it may be tinted.\n\nIf the light is TRULY white, then so be it, but I don't think physics will work in your favor with red tinted reflectors.", "meta": {"score": 1, "top_level_comment": "d7oxyzz", "retrieved_on": 1475728271, "gilded": 0, "gildings": null, "subreddit": "AskACop", "stickied": false, "permalink": "", "author_flair_text": ""}}
{"id": "d7qp4js", "user": "Retrogaymer", "root": "4zei90", "reply_to": "d7oxntp", "timestamp": 1474131077, "text": "Have you ever had to deal with a similar situation before? What kind of training do cops actually have for dealing with people with mental illness? I understand that most cops experience with mental illness is from the guilty hoping that faking it will get them out of the situation, but are they actually trained to tell the difference between someone faking it and the real thing? Does that training only apply to someone whose mental illness actually makes them dangerous or does it also apply to someone like me who instinctively reacts to danger that probably isn't really there even when they know it's all in their head? \n\nAs for the experiences that taught me to not trust cops, I'll pm you with more details if you want, but strike 1 was when I tried reporting an assault and was told that I had willfully participated in my own torture. Strike 2 was a DARE officer who planted the drugs on every student he caught with drugs. All legitimate offenders who were actually caught in the act were caught by school staff or other students. I wonder how many legitimate offenders got away with it because they happened to be caught with drugs he planted on them rather than drugs they actually had. Strike 3 was being told that displaying symptoms of mental illness was grounds for being charged with disturbing the peace and/or disorderly conduct. ", "meta": {"score": 1, "top_level_comment": "d7oxntp", "retrieved_on": 1475771818, "gilded": 0, "gildings": null, "subreddit": "AskACop", "stickied": false, "permalink": "", "author_flair_text": ""}}
{"id": "dci58nz", "user": "soflopaintball", "root": "5bjsq7", "reply_to": "5bjsq7", "timestamp": 1484587793, "text": "Saw this was posted 2 months ago so not sure if you already taken care of it but I know in FL if the cop doesn't show up the case is dismissed ", "meta": {"score": 1, "top_level_comment": "dci58nz", "retrieved_on": 1486098584, "gilded": 0, "gildings": null, "subreddit": "AskACop", "stickied": false, "permalink": "", "author_flair_text": ""}}
{"id": "df4030k", "user": "[deleted]", "root": "6078u3", "reply_to": "6078u3", "timestamp": 1489881286, "text": "[deleted]", "meta": {"score": 1, "top_level_comment": "df4030k", "retrieved_on": 1491599583, "gilded": 0, "gildings": null, "subreddit": "AskACop", "stickied": false, "permalink": "", "author_flair_text": ""}}
{"id": "dhd96l0", "user": "thatonerandomhuman", "root": "6abjdt", "reply_to": "6abjdt", "timestamp": 1494408158, "text": "I would recommend filling a a formal complaint, or try to get a restraining order if you know the name of said rapist, if not, still contact your local police department, they should be able to help. I'm not personally a cop, but all the other posts seem to be at a loss of comments, I hope you can get your problem resolved soon, if not, maybe invest in a knife or conceal carry license or possibly even pepper spray if it is legal in your area.", "meta": {"score": 2, "top_level_comment": "dhd96l0", "retrieved_on": 1496405752, "gilded": 0, "gildings": null, "subreddit": "AskACop", "stickied": false, "permalink": "", "author_flair_text": ""}}
{"id": "dhecysn", "user": "sakurarose20", "root": "6abjdt", "reply_to": "dhd96l0", "timestamp": 1494460077, "text": ":) Thank you for the advice.", "meta": {"score": 2, "top_level_comment": "dhd96l0", "retrieved_on": 1496424909, "gilded": 0, "gildings": null, "subreddit": "AskACop", "stickied": false, "permalink": "", "author_flair_text": ""}}
{"id": "dherkz4", "user": "thatonerandomhuman", "root": "6abjdt", "reply_to": "dhecysn", "timestamp": 1494481034, "text": "You're very welcome, I hope my advice helps your situation!", "meta": {"score": 1, "top_level_comment": "dhd96l0", "retrieved_on": 1496431937, "gilded": 0, "gildings": null, "subreddit": "AskACop", "stickied": false, "permalink": "", "author_flair_text": ""}}
{"id": "dhinvf2", "user": "sliceofpisces", "root": "6abjdt", "reply_to": "6abjdt", "timestamp": 1494706200, "text": "I have dealt with similar things in my life. \nI was 16 and vulnerable and a 25 year old became obsessed with targeting me. I'm now 25 and I can still \"feel\" when he's about to come around. \n\nHe used a lot of different numbers, email addresses, etc. \nI'd recommend talking to an officer about an order or protection. From what I understand, and this may vary state to state, you can get one for two weeks to a month without going to court, although that would be a good permanent solution if you seek that. \n\nI didn't but I have looked my person up on sites like pipl and truepeoplesearch to keep tabs on his address, phone numbers, email addresses, etc. It makes it easier to be aware of where he may be.", "meta": {"score": 2, "top_level_comment": "dhinvf2", "retrieved_on": 1496499567, "gilded": 0, "gildings": null, "subreddit": "AskACop", "stickied": false, "permalink": "", "author_flair_text": ""}}
{"id": "dhjgd5v", "user": "untamed_skittle", "root": "6b2j54", "reply_to": "6b2j54", "timestamp": 1494761698, "text": "How big is the agency you are working with?  You may have better luck not calling 911 and calling the direct number to their dispatch. Also if you are a regular caller now after a couple weeks of regular calls they will remember where you are located.", "meta": {"score": 1, "top_level_comment": "dhjgd5v", "retrieved_on": 1496513315, "gilded": 0, "gildings": null, "subreddit": "AskACop", "stickied": false, "permalink": "", "author_flair_text": ""}}
{"id": "dhjgjdl", "user": "untamed_skittle", "root": "6abjdt", "reply_to": "6abjdt", "timestamp": 1494762199, "text": "Okay was the initial sexual assault reported?  If not the statute of limitations on most sexual assaults in non existent or very long.  If you have his phone number then give it to the police.  And yes I would see about getting a protective order or restraining order depending on your state.", "meta": {"score": 1, "top_level_comment": "dhjgjdl", "retrieved_on": 1496513399, "gilded": 0, "gildings": null, "subreddit": "AskACop", "stickied": false, "permalink": "", "author_flair_text": ""}}
{"id": "dhjgs19", "user": "untamed_skittle", "root": "5yv57g", "reply_to": "5yv57g", "timestamp": 1494762856, "text": "Your leasing office won't do anything why?  Usually those offices are nazis when it comes to people who are not on the lease.  I would go into the office one last time and tell them either they need to do something about the situation or the cops are going to start being here often.  If other roommates are feeling the same way you are then all go to the office together.  You need to stand up for yourself though and if illegal activity is taking place, i.e. The pot, then tell them to not have that crap in there or you're calling the police.  I've dealt with situations like this in the past and I've found that usually everyone is smoking the pot.  As far as having her evicted or whatever....the squeaky wheel gets the grease.  If the office won't do shut just start calling the cops on her every time you see weed or smell weed.  If you're not partaking in the devil's lettuce then explain to the cops that you are calling them every time because you don't want to get in trouble.  But definitely start a paper trail.  Also review your lease.  There are a lot of clauses in there that allow for broken lease in some circumstances.  As for her mail, sure snap a picture of the mail.  If it's in common areas of the house it should be open game to look at.  Now I'm not saying open the mail or take the mail, I'm saying observe the mail.  Also when does your lease expire? ", "meta": {"score": 1, "top_level_comment": "dhjgs19", "retrieved_on": 1496513514, "gilded": 0, "gildings": null, "subreddit": "AskACop", "stickied": false, "permalink": "", "author_flair_text": ""}}
{"id": "dhjgvxs", "user": "untamed_skittle", "root": "602zvy", "reply_to": "602zvy", "timestamp": 1494763144, "text": "Call your local police and ask them.  Or just don't post the picture. I live in America and we can.  In Romania I have no idea bud.  ", "meta": {"score": 1, "top_level_comment": "dhjgvxs", "retrieved_on": 1496513567, "gilded": 0, "gildings": null, "subreddit": "AskACop", "stickied": false, "permalink": "", "author_flair_text": ""}}
{"id": "dhjs9k9", "user": "sliceofpisces", "root": "6b2j54", "reply_to": "dhjgd5v", "timestamp": 1494782081, "text": "I do mostly call dispatch, sorry, I meant that in the first place. The problem is my home is literally right on the county line so it messed up in the system for zip code and county and always takes twice as long to get a call in. ", "meta": {"score": 1, "top_level_comment": "dhjgd5v", "retrieved_on": 1496519029, "gilded": 0, "gildings": null, "subreddit": "AskACop", "stickied": false, "permalink": "", "author_flair_text": ""}}
{"id": "dho5cmt", "user": "untamed_skittle", "root": "6b5nx0", "reply_to": "6b5nx0", "timestamp": 1495021200, "text": "I wouldn't worry about it too much if it's a simple spelling error.  The question is if they typed the way it says on his ID and sent you something in the mail would it get to you?  I'd personally just pay the like $20 and fix it.", "meta": {"score": 1, "top_level_comment": "dho5cmt", "retrieved_on": 1496594691, "gilded": 0, "gildings": null, "subreddit": "AskACop", "stickied": false, "permalink": "", "author_flair_text": ""}}
{"id": "dho5ddn", "user": "untamed_skittle", "root": "6b5nx0", "reply_to": "6b5nx0", "timestamp": 1495021241, "text": "I've worked in cities where the street is spelled two different ways on two different signs.", "meta": {"score": 1, "top_level_comment": "dho5ddn", "retrieved_on": 1496594701, "gilded": 0, "gildings": null, "subreddit": "AskACop", "stickied": false, "permalink": "", "author_flair_text": ""}}
{"id": "dho5gon", "user": "untamed_skittle", "root": "6bjc1i", "reply_to": "6bjc1i", "timestamp": 1495021424, "text": "Illegally exploring sounds like a different way of saying trespassing.  Depending on the state and their laws...you could be arrested.  I'm curious what kind of land we are talking about, and why you say illegally exploring.", "meta": {"score": 2, "top_level_comment": "dho5gon", "retrieved_on": 1496594746, "gilded": 0, "gildings": null, "subreddit": "AskACop", "stickied": false, "permalink": "", "author_flair_text": ""}}
{"id": "dho6gzl", "user": "Maegaa", "root": "6bjc1i", "reply_to": "dho5gon", "timestamp": 1495023334, "text": "Places like national and state owned campgrounds. In areas that are closed off to the public.", "meta": {"score": 1, "top_level_comment": "dho5gon", "retrieved_on": 1496595232, "gilded": 0, "gildings": null, "subreddit": "AskACop", "stickied": false, "permalink": "", "author_flair_text": ""}}
{"id": "dhpcnfh", "user": "untamed_skittle", "root": "6bjc1i", "reply_to": "dho6gzl", "timestamp": 1495072864, "text": "Ah got ya.  I do not have that answer sorry", "meta": {"score": 2, "top_level_comment": "dho5gon", "retrieved_on": 1496615512, "gilded": 0, "gildings": null, "subreddit": "AskACop", "stickied": false, "permalink": "", "author_flair_text": ""}}
{"id": "dhpcvat", "user": "Maegaa", "root": "6bjc1i", "reply_to": "dhpcnfh", "timestamp": 1495073142, "text": "It's okay man don't worry about it.", "meta": {"score": 1, "top_level_comment": "dho5gon", "retrieved_on": 1496615617, "gilded": 0, "gildings": null, "subreddit": "AskACop", "stickied": false, "permalink": "", "author_flair_text": ""}}
{"id": "di21gyp", "user": "untamed_skittle", "root": "6c1j5n", "reply_to": "6c1j5n", "timestamp": 1495768761, "text": "In Texas if the tags are expired he could get a citation for expired registration.  In some cases depending on what those plates coke back to he could also look at displaying a fictitious license plate.  Most traffic laws are the same around the country, but his reason sounds silly in my opinion.  But as for the registration being expired absolutely.", "meta": {"score": 1, "top_level_comment": "di21gyp", "retrieved_on": 1496835737, "gilded": 0, "gildings": null, "subreddit": "AskACop", "stickied": false, "permalink": "", "author_flair_text": ""}}
{"id": "di21hjv", "user": "untamed_skittle", "root": "6c1j5n", "reply_to": "6c1j5n", "timestamp": 1495768786, "text": "Also if you're driving the car then you will be held liable.  ", "meta": {"score": 1, "top_level_comment": "di21hjv", "retrieved_on": 1496835746, "gilded": 0, "gildings": null, "subreddit": "AskACop", "stickied": false, "permalink": "", "author_flair_text": ""}}
{"id": "dj1o1c2", "user": "CopeLCgolfer", "root": "6hvpxx", "reply_to": "6hvpxx", "timestamp": 1497742445, "text": "License plate readers ", "meta": {"score": 1, "top_level_comment": "dj1o1c2", "retrieved_on": 1499437473, "gilded": 0, "gildings": null, "subreddit": "AskACop", "stickied": false, "permalink": "", "author_flair_text": ""}}
{"id": "dj1zbtg", "user": "untamed_skittle", "root": "6ds77b", "reply_to": "6ds77b", "timestamp": 1497760850, "text": "Most states require you to have a valid ID in the state you reside.  When you move you have a certain amount of days like 30 or 90 to get it done.  After that you could get a citation for failure to update address and such.  If you moved for school though you are not required to change it most of the time.  But again an ID at minimum.", "meta": {"score": 2, "top_level_comment": "dj1zbtg", "retrieved_on": 1499442946, "gilded": 0, "gildings": null, "subreddit": "AskACop", "stickied": false, "permalink": "", "author_flair_text": ""}}
{"id": "dj1zcz6", "user": "untamed_skittle", "root": "6d48xr", "reply_to": "6d48xr", "timestamp": 1497760909, "text": "Possibly making sure squatters were residing in their empty apartments. ", "meta": {"score": 1, "top_level_comment": "dj1zcz6", "retrieved_on": 1499442962, "gilded": 0, "gildings": null, "subreddit": "AskACop", "stickied": false, "permalink": "", "author_flair_text": ""}}
{"id": "dj1zfdd", "user": "untamed_skittle", "root": "6cb1ho", "reply_to": "6cb1ho", "timestamp": 1497761030, "text": "Great question.  Sometimes is hard to hide it and others can tell, but training and being ready for anything keeps me calm when necessary.  I tell a lot of people that I talk to about this and that I train that this job is for a certain type of person.  Most can do it, but few last.  A certain type of person can naturally do the job. ", "meta": {"score": 1, "top_level_comment": "dj1zfdd", "retrieved_on": 1499442994, "gilded": 0, "gildings": null, "subreddit": "AskACop", "stickied": false, "permalink": "", "author_flair_text": ""}}
{"id": "dj2dn7g", "user": "jackberserk", "root": "6cb1ho", "reply_to": "6cb1ho", "timestamp": 1497795407, "text": "Thank you for the advice! I hope you stay safe  and finish the remainder of your tours of duty safely and thanks for keeping the streets safe! ", "meta": {"score": 1, "top_level_comment": "dj2dn7g", "retrieved_on": 1499450227, "gilded": 0, "gildings": null, "subreddit": "AskACop", "stickied": false, "permalink": "", "author_flair_text": ""}}
{"id": "dje04k7", "user": "Phollie", "root": "6abjdt", "reply_to": "dhjgjdl", "timestamp": 1498419875, "text": "This is solid advice. At the end of the day OP has to be the one to take measures to protect herself, because no one can step in and protect you when it comes down to it. You gotta be the one to pick yourself up and toughen up and find your resolve. Either ignore it and let it bother you every time you notice it, or take action and refuse to be victimized again.", "meta": {"score": 2, "top_level_comment": "dhjgjdl", "retrieved_on": 1499653921, "gilded": 0, "gildings": null, "subreddit": "AskACop", "stickied": false, "permalink": "", "author_flair_text": ""}}
{"id": "djg1d0x", "user": "FactsIMadeUpJustNow", "root": "6hvpxx", "reply_to": "6hvpxx", "timestamp": 1498527805, "text": "They run tag info against a database and check the vehicle and registered owner for wants and insurance and stuff.", "meta": {"score": 1, "top_level_comment": "djg1d0x", "retrieved_on": 1499689461, "gilded": 0, "gildings": null, "subreddit": "AskACop", "stickied": false, "permalink": "", "author_flair_text": ""}}
{"id": "djg1hbi", "user": "FactsIMadeUpJustNow", "root": "6d48xr", "reply_to": "6d48xr", "timestamp": 1498527952, "text": "Also could be canvassing for info. A lot of people may have seen or heard a crime but don't put effort into notifying anyone.", "meta": {"score": 1, "top_level_comment": "djg1hbi", "retrieved_on": 1499689519, "gilded": 0, "gildings": null, "subreddit": "AskACop", "stickied": false, "permalink": "", "author_flair_text": ""}}
{"id": "djh7loi", "user": "Bad_doughnut", "root": "6hdhff", "reply_to": "6hdhff", "timestamp": 1498592139, "text": "https://www.theeastsiderla.com/2017/06/motorcyclist-killed-by-hit-and-run-driver-in-echo-park/\n\nThis it?\n\n", "meta": {"score": 1, "top_level_comment": "djh7loi", "retrieved_on": 1499710786, "gilded": 0, "gildings": null, "subreddit": "AskACop", "stickied": false, "permalink": "", "author_flair_text": ""}}
{"id": "djhgaod", "user": "Butt-Factory", "root": "6hdhff", "reply_to": "djh7loi", "timestamp": 1498601909, "text": "Yes,  that's him", "meta": {"score": 2, "top_level_comment": "djh7loi", "retrieved_on": 1499715189, "gilded": 0, "gildings": null, "subreddit": "AskACop", "stickied": false, "permalink": "", "author_flair_text": ""}}
